#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AB_C000.AB_C000_C
// 0xC05C (FullSize[0xC5BC] - InheritedSize[0x0560])
class UAB_C000_C : public UATCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0560(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_97BDDCD54CE241E820FEACBCF7FBB5FE; // 0x0568(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4C068BF74335E61B02900DBC4BB6B285; // 0x0640(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5214470445F119F7B02D2ABEF25B224A; // 0x0718(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_836ED438447867892EA9378390DB3392; // 0x0760(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_0891F2414850AB5E48EA6D8CB642DAAE;       // 0x07A8(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1956FDE144DB4CCEFE0E1684AADF2266; // 0x0810(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F4317DF341158397D09DF299C845C852; // 0x08E8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8B75EE72404CD50BC24EA28A9EBD8611; // 0x09C0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4F27E9F24F98067BF13DAC8510BF3ABF; // 0x0A08(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1E7AEF99451069C846DD839D5B18403C; // 0x0A50(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_CD3C74614CB93E34816DDABD90939F3B; // 0x0B28(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F239467E4D35ED12D076EEA1739BD399; // 0x0C00(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1D1D214D49298CED4DA1A09F6301D861;       // 0x0CD8(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7619B57046464EA869AB83A7FC35981B; // 0x0D40(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2AAC404044F15561D27CFD8CFA8D3EA4;       // 0x0E18(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_EA112DC842D416BECAAC578EE0076828; // 0x0E80(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6EFF7E7E4CC5D7057156D0BEF1C61224; // 0x0F58(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9B1F919A4B1CBFF1C870729E5D0B1D9E; // 0x1030(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_20F5EFDA407A5CA6B1F871ACF7E620E5;       // 0x1108(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_228A697E4BE10D2F76FDE7ACFA39DFD6;       // 0x1170(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F2B2AA6B4F08CA7D9489E2B9FBE66A02;       // 0x11D8(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B74669204145FD6F7B154FB8EB2937D8; // 0x1240(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_241E088D40E9665605C485A0B64852D4; // 0x1318(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_35EC1A274DA9A9BAA00A6E9D80657E23;       // 0x13F0(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C92999834B33CE46929CED94FC0CF4B5; // 0x1458(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D7CE0AB146BECBAF2EAC219F0C901291; // 0x1530(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3F0192D84F815F3F20885192E8AA549A; // 0x1608(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B99F44A04DBA970800935293CEF56B3F; // 0x1740(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6DF352F84410EBC755B3EEB4E449331E; // 0x1780(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8352978648589F450AF148AA29ADEE32; // 0x17C0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2DEEDF534BA85F92779578AB2C0DAD79; // 0x18A0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CF69D9FD475284FC45DD488633EE32B4; // 0x1978(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E9D4AAA7440408923D03679BD16E98A2; // 0x19C0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_472FCE674AD2069341EE728CA2C9C3AF; // 0x1A08(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AB94D8F542471A44FE19BD8AF4EC6B43; // 0x1A50(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B2A3E11F42771CEC3EEFA48CDFB0DA34; // 0x1A98(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BDD2CFB649FFCDF13F0CC59D9ED0036B; // 0x1AE0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7D85B0A7483A3AEEDD023F864FB3BDEA; // 0x1B28(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_75A5F88B4ABC2D902F53B0AD1F86BA11; // 0x1B70(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_47C0CD834AABB31BA9B50DAAA475C307; // 0x1BB8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A15CDA584681DA82EB8FB2B13A49ABFA; // 0x1C00(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_664E321E40D893B62559C892E7ED3EB0; // 0x1C48(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_700E8A864A8E7628D25FBE8EDB31270A; // 0x1C90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68D1F75A49C36C50592A6599CE50A945; // 0x1CD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE88631449BACB6BAC973BB77D02C1F6; // 0x1D20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D1833A14E80B1E94307A78D91979061; // 0x1D68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF62CDE647B38A04AD32FC97366908C3; // 0x1DB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B3C052684C332759E2203591EE0DF7AA; // 0x1DF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED36C69E44EB7328F8455AB760B7278B; // 0x1E40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C895B4B94E6802916C15B48789A25FD2; // 0x1E88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2C530F94681ABF8EE275DA2C2D43A43; // 0x1ED0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AE9A29F404684E129B67590647E9CB7; // 0x1F18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C215F564429C0755008866A1EC056E2F; // 0x1F60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F359EC340AD294E4BFE44848D87D1F7; // 0x1FA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AF1645147F84D688B7AEB98CE173EBE; // 0x1FF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C96E766D48E9BF2B88A0D1ADBF64F474; // 0x2038(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B9E5B00B4D48ADC8CD916C991F7FF01B; // 0x2080(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12B7BA5D401F2570A411A590E59D479B; // 0x20C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23C3068D42910205F271899E333511F3; // 0x2110(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D6C9A4114DE7957DFD49E5B0F1854E3D; // 0x2158(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88745CBA40288E350F22F7B1D8E24C82; // 0x21A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE35E89343F6C0F159A232A4EBAC0A2D; // 0x21E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB1CF37B4FBAEA9B85A238A4A3E83ECF; // 0x2230(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C3F6B18456F8B506776B3A949F6EA11; // 0x2278(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D266D36F47D2914FE7FC829F4237809E; // 0x22C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BCFF42F44E3CFA8152CEE97B032D256; // 0x2308(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FDBD97245FF7A2326DBD697845F6B90; // 0x2350(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30212C30407AD9ACC3FE1D9E4BDF756D; // 0x2398(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7428A73944A0D3958D57388C26BD5D65; // 0x23E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8BA85A9A4A6EDA8F2D4762A27827BD88; // 0x2428(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C16DE71B4EB866826FBEE69C3FE81111; // 0x2470(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5ACB9E374C7F2F8A9C409494DB723891; // 0x24B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD89144C472FC22D5C6A259D4423FEF3; // 0x2500(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_886BB8AF4E2CA0B1A80144BE8E2F756A; // 0x2548(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A108449440EDB3AB35332CA4F6BB4BBE; // 0x2590(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9EBE6D34A46321CD6EB18A2BA5DF577; // 0x25D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F5E5477B4F800D93F646619D4B88993B; // 0x2620(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C4DC1DC4032C5592F8931B29857B2DC; // 0x2668(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_573145D1491E382D04114491A41C55E2; // 0x26B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54D7D7D349D789FC4E6EFD92FA143F27; // 0x26F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE81400942C33BF179E016807B79E95A; // 0x2740(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3373CBC843AC55C2790D109F83AD2EE7; // 0x2788(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D309FFB64ED007BEA93F09885D7C2FF8; // 0x27D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4B8C9C24EE4D857003613B0248B8C3C; // 0x2818(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CAA8EA814C920C304034D1A9EF22D0A0; // 0x2860(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A39F32FE46E1373905CBEFA3331B0EDA; // 0x28A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F62F2B9041B1EEEDD18B59B70EF0EBBF; // 0x28F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D27F7E4D43DA87B159B8349E4E6F14B3; // 0x2938(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78B36D144005B41E3E9D6196BB4C4BDA; // 0x2980(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_343DB8EC456C0468EBBB0C98F16ECFFE; // 0x29C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64C3CF874460D016A6B9CBBCF242912B; // 0x2A10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72A7434545F86DF12DE771983C80F9FF; // 0x2A58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0BA3F1ED4D7847C267D28FAC934E9477; // 0x2AA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D7D9A5C45D990CDAAD5BEB49935CC34; // 0x2AE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE7D1C9942C8CEA832376CA34921B543; // 0x2B30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D56B5CA40A2C446D64C8FB328F77575; // 0x2B78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEED98384E306DF78BF793BD0B61EA76; // 0x2BC0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8A311D346498429B1155A98F75BD20A; // 0x2C08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47D34C8743484D8A05A7F489E5C7A821; // 0x2C50(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98346F4D45BC56522852CF89DBF8B6A1; // 0x2C98(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41B315B74658077738D43F86015A6C4E; // 0x2CE0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D04F6AF4FF19259EE1C5DA65B8D0E13; // 0x2D28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E7B7CF3F4270B2B2C98D1DADBABA9823; // 0x2D70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29D0EB134DC57666B98CB9974755712B; // 0x2DB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEA7519741CF6B4DA76A4699A6BB532E; // 0x2E00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8AADBEAB4599A5F095A983B0BFE28470; // 0x2E48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8A8F33344EA6FEE137C09BC8DB594A4; // 0x2E90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12688E35465CBFED8D5320B7183E283B; // 0x2ED8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F07A3BE4E1285A3BCC32DA6F3B1D901; // 0x2F20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE95C9DD44FA5BB1A84B9EBF2A1E6673; // 0x2F68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2BB1C3F48D7B20B4469B3880BD39776; // 0x2FB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5DEC452484A3E25A9E867BFFED6CCB1; // 0x2FF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F725A8146281E77A8498B846C11D18D; // 0x3040(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F27C33794C5C3ED20D58F7BE8FBD0CD0; // 0x3088(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4362C66D43E5EDC4F4C7BC8E54E3C918; // 0x30D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D0D72884D135302FD272498FD460EF7; // 0x3118(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F97DB7D34E49B511626D11975F037562; // 0x3160(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B51A1B5A4B0CCC5C69223A9F8B1E82E6; // 0x31A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F4AE3C14CD277B09B6E2DB604E77D7E; // 0x31F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22C903A44100B3424A0E23BA01B25C13; // 0x3238(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AC434CE547A6B59264EB969B24A0FA46; // 0x3280(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D61DA7F4BD97652D23FD4B6361926B0; // 0x32C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7982B7BB44D6461CE442AA92BE00346D; // 0x3310(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B79D4C5B4E7CAB6D4AF954BE1775F525; // 0x3358(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12E662054D678F1887FE6AAF244122C0; // 0x33A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BF6323C4357951B4CB6BD859A43BF26; // 0x33E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96DAC3D345270EE82E36A0B077B8AE34; // 0x3430(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B3491E749F17C38FB17F688A1AB2B9E; // 0x3478(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_995E888E47ECB5ED118C9286EA99634A; // 0x34C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_368ED987473BE0815F52B78E6721F894; // 0x3508(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90CED8B243CD9DE6CA99528AB0427FA0; // 0x3550(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_038BEF1A42C84044069356A8EC45E680; // 0x3598(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE8198FA4A3F2609ED304FBCE582D1B1; // 0x35E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CBC04D044A4F98A3153D469902750CFC; // 0x3628(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8A6BADC648BEF1B400A4E3B31A03EE2C; // 0x3670(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91874C224DAE0596AC750996620DA0F9; // 0x36B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B28DCE664A73035E55D92CAB2BC8C07D; // 0x3700(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83F80F67422EAED9B760BCB8496CA612; // 0x3748(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98DAF8554E42CE35444FDBAE9F37CE52; // 0x3790(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3237FC72478DAE46AE5C938946E4DBC4; // 0x37D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B73ECA74FA79920D4CF99A217FC93EE; // 0x3820(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61694F6D4599A1530802C6A52842E96D; // 0x3868(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_448309834E3A3D99FEE0E0B711EF3FAE; // 0x38B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4F88A1A4F75AB003162E58E25DE93E8; // 0x38F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_017E04F94C50AECFEB8E4C9A2A7D0D03; // 0x3940(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50ECDDAB49A52F83AA0EF98B837D3D86; // 0x3988(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E2E3623642C1848C8ADD57A5CF67C5C7; // 0x39D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_855588744E483C5A1DB599B2BFDE0B70; // 0x3A18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_903AF80B49D58C928A97938230AAC17D; // 0x3A60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41B09261454172E7566378B29FEB3D15; // 0x3AA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36042C5D4CDA4F6766E85482B8FFD878; // 0x3AF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F62E6344BD74CE77738568E9AF5191D; // 0x3B38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C56052340D16B874A5D5D80AD4DEFE6; // 0x3B80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD26F9E24FAC13849A6DBEB8797EE5D1; // 0x3BC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF35CC3E43382F86AEE5BD8AE7E0A864; // 0x3C10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C47EEFBA4E60C11C22209496F6CD5E4E; // 0x3C58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B5AAA9E4C2C165C78FE69BF0C8BBF4E; // 0x3CA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2A8F38CA42C8F4CF9397AA862E8437B2; // 0x3CE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_730C416A450A79177520BFB0486DB82A; // 0x3D30(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C244459643D344114A2704AA8D146EC7; // 0x3DD0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8658289E4360E2295322AAA439230276; // 0x3E10(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_26C527BE47EE886F1B7501993B855221; // 0x3F38(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8E55BE594051CD485CACFC9AFA0BB10D; // 0x3F78(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_91B8B4DF409CCB16C740E080FE6B8BBE; // 0x40A0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8344DF3B4A5867829C54EB999F964663; // 0x40E0(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EFF82749485AA9AFB4A2F08FE0AC120D; // 0x4208(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_81DB105143A934D4AF9E3087B68FEDAF; // 0x4248(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_ECB4AB1A458A19959E0F8B9902FB3747; // 0x42E8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1F1A4BFB4494A54BC26227881362E495; // 0x4328(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3AF1C62F471BA4D1C419A1A391319A57; // 0x43C8(0x0040)
	struct FAnimNode_TransitionPoseEvaluator           AnimGraphNode_TransitionPoseEvaluator_17672B374732BF17C9573A9801149F3C; // 0x4408(0x0078)
	struct FAnimNode_TransitionPoseEvaluator           AnimGraphNode_TransitionPoseEvaluator_AC2F994B46E6BA0EE9636ABFCB3B42C8; // 0x4480(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_CustomTransitionResult_C70411E84C44AA250F6C72B52055813D; // 0x44F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E033DC042DE75AB6FAB17AE283DE6CC; // 0x4538(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19F4695C4241F2101B48309256C9D156; // 0x4580(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_511C77524B17C31C6C52499525E19579; // 0x4620(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44AE3E05460AA2072857B4AA028ED394; // 0x4660(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_056B283D452A7AE419E541A323A8DB8E; // 0x4700(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1EF4B3EA40BA8EAD372B2C9DE536D511; // 0x4740(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2286818041229BBCEB9D67AE182B72DD; // 0x4820(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E9B9EF64E4CC28A5B23C2A739C9089D; // 0x4860(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B22B6D644B554D179999539364BB2F57; // 0x4900(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4FA0C0404A2D93E271F7ACADE3777D24; // 0x4940(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9D72CBA34231D233F83EBE90D4C741E9; // 0x49E0(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F927D248486F71165916A7B13CD3597B; // 0x4AD0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_476505434355E1F2D373A599D96F9712; // 0x4BF8(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_22EC7DDC4C521A61D33A8A9D33825E11; // 0x4D20(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FF2D8B904DD92745A16E0C9DFCBD9894; // 0x4D60(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_245B9B774D9D760EF6D73BAA9E3840E6; // 0x4E88(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5098A1F4478CA924F3FFC590EA5D58AF; // 0x4EC8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A54191EA415E8BFE06B046A457926CA3; // 0x4F68(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2EA81AAC43E93A95597BD4A2DB437DF0; // 0x4FA8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_569400E949C7FB408DB4C89D38C5807F; // 0x5048(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FF8EFAF3419CCDBD36D15FA7E32DE80A; // 0x50E8(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B5A8793244DB18AAF500B6BE1DEF602F; // 0x51D8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_70378B824B4AE2D9EC1792BDC5BE00EA; // 0x5218(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D96AFB1A491AA419486CD5BFF296F45C; // 0x52B8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_728FFAB44C1F2A7FBF0FFA9845929DDB; // 0x5398(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_17BA3F1D4772E66D5452D0A189042417; // 0x5438(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6D7CBE0F4E23B9F27E4BBF9A3DF85A12; // 0x5478(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8AE18D2240458DA263404B824510F266; // 0x5558(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FFAD43304B1FE02764724F80E6D5A984; // 0x55F8(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A32B7354458EBCBEFE9DC986A0FA7471; // 0x5720(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4543FB884290F836F259FE8DD1D20723; // 0x5760(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_401C5D62498F2B43391F4D90710E1DA7; // 0x5800(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A62147394E86A18C2BDF2E8544F9F471; // 0x58E0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3BFA6D40496901AB53A987835344CA0F; // 0x5980(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FEBDF4194450796C64E4CE95A59FB32E; // 0x59C0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_472CB9654F21729A48D216875804A7D9; // 0x5A60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37160EB249D470A48B08C889EF44F200; // 0x5AA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB09F1D2424F3F9564FDD992376521A4; // 0x5AE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCFD48494F657E5EEB63DCAAF57909F0; // 0x5B30(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7A6A26834F6B5A00576A48BB0C7C9344; // 0x5BD0(0x0040)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F0B876284AC2240156617BBF933FA742; // 0x5C10(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3EBFA33E4B0D937CBBFA4BA2A43FDC48; // 0x5D00(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C9DA686A4D8256E5826F76B95BECBA6A; // 0x5DA0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AA9B8E504457CE95144F63A0E08B77A8; // 0x5E40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2198271C4FF4A99DD1EA4BB66B806CC1; // 0x5E80(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D422841540C8567A7F44F990372AE6B3; // 0x5F20(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0C2F4AF1418A1B688C38A98A112561A3; // 0x5F60(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CEB5AEFA47DFFB00C33878B445C33E1A; // 0x6000(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA76204F48BFAB3AF948C19416A1BDD3; // 0x6040(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D7662A42468D07419F7AE7A55418AFA7; // 0x60E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD3D874B47A0E2EFEC974A8689715ACF; // 0x6120(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B0CE65794B219551E3A5B09964761A8F; // 0x61C0(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B406DA524861C2BF77EBAF834282E267; // 0x62B0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C0ED28BE4ED73070A2D5AEBDBAAE6AD9; // 0x63D8(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_16DB3FB9464F5E9004B80FB40E235E38; // 0x6500(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE179F46463E8A7FAA4ADF98951C2C76; // 0x6540(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5706189F4500C2A4E22081A125992C2B; // 0x65E0(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7E9CD5144BBF8E57E9A49CA152D0E134; // 0x66D0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6667E7D1422321E8468991BE49201D0C; // 0x6770(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_60302E04408F1DEABCB33AA209F75296; // 0x6810(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9709F34542CC46157098318582E7B285; // 0x6850(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_15C8E3A0439D344A26F2C390BB2335A6; // 0x68F0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B2B761534BD29573E00C7494F33EFD7F; // 0x6930(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C70321964B0AEE4F76D916862DE6FCB9; // 0x6A58(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D61F6E9D41610F02A004C7B2337C395E; // 0x6A98(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C9DDAC914F76F2341EE734A159E4384D; // 0x6BC0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C9A4208540B765543A2E37827E0E2235; // 0x6C00(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6852B2AE47F7BB8F4A33E2B93D301990; // 0x6D28(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F7E9689A45E6432084796D8132F40BD5; // 0x6D68(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B2CC524F4CC0AA05697AE885EB266F86; // 0x6E90(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_334B0F244AF267EFAFDF4DBB99B6D29F; // 0x6ED0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17F918A245668BD0BF77D0A56895E9C6; // 0x6F70(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1D33451E42D04AFA8B8235B8A4AEB101; // 0x7010(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12B75D424E2CEF67ECC7199ED62FDAE4; // 0x7100(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2A79FC0B4FE870B7AF0684BE18EDECC2; // 0x71A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_547F83E942A7E836F2F66DB1D22BF5F5; // 0x71E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FAE61374E309D2FBD5A679BE1CDC4C8; // 0x7228(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9892C18B4B6593278B3177B506A30D4D; // 0x7270(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7C504E2E4084A24B6B27DE95FF032242; // 0x7310(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_62D6CA6443D9A913A51718BB3E64FA33; // 0x73B0(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0AE221984C049D19CD52F08699030176; // 0x74A0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AA15CDA54F2D6912431529B3BFC473BC; // 0x74E0(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_13FD08414DD5A3D9461991953A6DBA8A; // 0x7608(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_159B6E444443D4FE85A572926F3A71DF; // 0x76F8(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5075597042653611A5A121AC79B76BC3; // 0x7820(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_050CD0A74219C21FCCB9CABE073C5F05; // 0x7860(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4225537A4A49C78621599D8AE1112421; // 0x7900(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6996576D4EDF58F3A89DB4A8FE1D7B3D; // 0x79A0(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FB04767D4BBCEA993C7F3081AAD79BD7; // 0x7A90(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D1F429A4ADC00F1A9037898024B555D; // 0x7AD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E41709624FF12E0F279534840AFB109D; // 0x7B18(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3ABEA6114BBBD1BDB91DC69201B8D45E; // 0x7B60(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2E8DB5F4534AB0ACC87C9AA4999D985; // 0x7C00(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9A7B335D42D670A5943B528561D32374; // 0x7CA0(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5077331D41DB7B0C479527862E914746; // 0x7D90(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B32526924C6EC24C626697A95DAA4A51; // 0x7E30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9EB18D224D261596276C17BC93E856E6; // 0x7E70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D609D42248CCF2E2A42203B672920F1A; // 0x7EB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7825CBA1468AF1B22533718B1398437C; // 0x7F00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9970E73B49DED0E316A9EFACD8B3C3E3; // 0x7F48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4D736A34FF2B45528DAFB89EC2172BE; // 0x7F90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03EF975B41C6E5EC41CDF8BBCB76F186; // 0x7FD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_09064D19431CC3C7F431F19C430B96B7; // 0x8020(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AF881B414602334AABC7188DF784A256; // 0x8068(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_61662B054E766CAFDF931AB7F5E85ABB; // 0x8108(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AEB9E6D047F17AAD2D513A836ED74118; // 0x8148(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B4AA8214554EAB90B46628EE5608914; // 0x8228(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_071BE90B4B88514B21DC638A7E4A9035; // 0x82C8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F740DC34C1703467DFD51B1B201B70E; // 0x8368(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B8CE562344AF2F2ACA4A9389E9647E9B; // 0x8408(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3D3E43F943D0EA019FB35E81258451FF; // 0x84F8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC20EC914B1D552A577050BBB8A8EDD5; // 0x8598(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_03B213A141DC0F4450743A8ABD84CCB5; // 0x8638(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DA9D43DE4F4B0E5EC06317880061D4D4; // 0x8678(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2094FA6041E6B431A0E2739E20EB97AF; // 0x8718(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C1E76DC345B91CB880406AB77C85130B; // 0x8758(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_28DF13084A71B5B7659EEA8802EB845C; // 0x8880(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1E52ECD34E8465D79F1ABBA3408DF7AB; // 0x88C0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D477A8704D122E4901E11DADA8CC69A9; // 0x8960(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AF01F17146A94EBD400FA7B07F270E57; // 0x89A0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4881177C46E50FD85EA80484E84F331D; // 0x8A40(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_03CBC33C4BF76700EB3E4A8341242C6A; // 0x8AE0(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_470DDDD24B06F421771A7196E03C152E; // 0x8BD0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_450E389049D3A5220ED0719465A45C68; // 0x8C70(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F85ED106444B24C93C12CFB764335EB5; // 0x8D10(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E996DE7F4D805432049D9F99C53837D0; // 0x8D50(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6E9B1B0A4DD1A16A76258A8F635E59E4; // 0x8DF0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18B6FAFE47B37FF899C2D9ADA32C5665; // 0x8E30(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_71FC6A9541C8E72ECBB6C08418BCBC19; // 0x8ED0(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A9E51AF64EBFA42103A8D988756A15F1; // 0x8FF8(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EA8B6E134E5649D3AB3CEAB5B1A0E0AB; // 0x90E8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E770D7AB47FB23F520212EB92574BDB5; // 0x9128(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E45645FF432C45DF75CF12B1696A6A9C; // 0x9250(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_579F1BFB48E24ECDCEDE6280DBF1806A; // 0x9290(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB53C43B486B22CD45405ABC39921880; // 0x9330(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A900730847F7316200576A9CBB4DEA85; // 0x93D0(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6E9395214B9A661EBEB0A1B2AF6981D5; // 0x94C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FACCEE9D41F6E1A520F1139EB7A17F38; // 0x9500(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C940E0104D7B1A92267C2299291706EB; // 0x95A0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA6E0D9F4799AABFFEDF61AB06479EEB; // 0x9640(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_87F0740A49E7BF9B6962FDB4395CACBA; // 0x96E0(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3E445E29409E5D2D893E7787875C623A; // 0x9780(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E1C9A439475E17A1085060BF145AAA05; // 0x9870(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5C970F4A49384CF8D006B38E6BA2FB5D; // 0x9910(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AC0C04334205AB5F42D41C8C5F018A56; // 0x9950(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2EAB5E6D49B9BF3C5236D69E940700E7; // 0x9998(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_Root_51C586FD43047A8883C4B0AFAE2B486A;       // 0x9A78(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_282D7D7744E3B2A9C3FB1180CEBD9C7F; // 0x9AB8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_80B0B43F493FE8B7903EC8A764BD3A4E; // 0x9BE0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2232DF5E47D1107915714EA73E8656A1; // 0x9CC0(0x00D8)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_B2A2CF3F4C4241380560D0A183D0CF78; // 0x9D98(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FAE6642E4F82C22B7A5886992D182CAE; // 0x9E00(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82D16FA742C512CA0AE221955537E866; // 0x9E48(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_084E173542B0D9BF19EFE1806CF45C55; // 0x9E90(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0DA8D1E34A2643D3F810F4955DC160B3; // 0x9ED8(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C3A9170D45B181314431CC8F9A22EFF9; // 0x9FB8(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_959044C847FF9409242151BAB7D71FEF; // 0x9FF8(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_77D5B272425D75B2E171AFA6E15802BC; // 0xA0D0(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CD97181B4DE741C720992FBD973EE2E7; // 0xA1A8(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_942663934BDF3CFFE68FECAEDC8A9903; // 0xA2D0(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_628D2D924532B27E6195628B06D663CA; // 0xA3A8(0x0040)
	struct FAnimNode_ModifyCurve                       AnimGraphNode_ModifyCurve_38BDAB7D4AB59812D71A57BD9B5B7CF5; // 0xA3E8(0x0080)
	unsigned char                                      UnknownData_0NC3[0x8];                                     // 0xA468(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_LookAtEyeBlend                    AnimGraphNode_LookAtEyeBlend_0EE326A048E656C0276A2B8067B56FAB; // 0xA470(0x0180)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7433597846BAB9BCB142FEAF7329BD7D; // 0xA5F0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_084863DC49CFE4616CCD2880F0B471AA; // 0xA6D0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6ED09C2E4740B4096FDB56A3930DF007; // 0xA7A8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BB87D230453200C132F5C0B68515A500; // 0xA7F0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7F61477A4015D72AC690D98237758AA0; // 0xA838(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_40A7E88541E1160A9982199191ACB4B6; // 0xA880(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_271BA3464DDD0297C5B3689662E63E7F; // 0xA958(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5A42CAEB4679A5A00D5888B5652E61E2; // 0xA9A0(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A0B120C84CD7C030F867DBB9B2A5284F; // 0xAA90(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1F1C44214B1B97146BAD7A8ED13E0D16; // 0xAB70(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5EFEE1A5494ABD8E1D713E99DCF1A1E6; // 0xABB8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FC1FB8E540F7FAFD498339B9FB6B3C6B; // 0xAC90(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8D0EB487400D9B6913DC96BA34177FBA; // 0xACD8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6A698CD647E2E239DDE06BBAD580CD98; // 0xAD20(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_843A70AF489A100C575FFEA0BDFF8849; // 0xAE10(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B28489B429F61DC88AD4EA7DA30FBBA; // 0xAEF0(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DA911D104822AE7F4877ED8C7E908053; // 0xAF90(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4AAF735C463302714EE981A8EBED8B0B; // 0xB080(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A10668B041387A6371C16BB3AE26DD4A; // 0xB120(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9BA766424159CD51DD38C8919793CD3B; // 0xB200(0x00D8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_77FA541143AD721E7E3E418953687BB3; // 0xB2D8(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_169BB639453CD9AAF89121AEB366B8E0; // 0xB318(0x0040)
	unsigned char                                      UnknownData_ULQ4[0x8];                                     // 0xB358(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_F2385C1943BF9647479788A81B31A4C6;  // 0xB360(0x0240)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_0B1322EE490D3374E25C448F698EE09E;  // 0xB5A0(0x0240)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_47129C774F462D5066C8CA8DF5811212; // 0xB7E0(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FAB3644A45FA20B4FE866F9FA45EC4F9; // 0xB828(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1C5704E64DF75F705267848AAC68624F; // 0xB900(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_306C721A4116CDED59BDAA9CCD49F169; // 0xB948(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F2F4F4AF47785592268483B98EE4ECF0; // 0xB990(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D922E45345B95F82DCD79EA5BF594D66; // 0xBA70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22AA255A455342AEDCFE4BA5F750CB82; // 0xBAB8(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7DD4B5ED486C50754CDE9F8E8EC545F9; // 0xBB58(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_70649027459D3FDC43C973ACB4AD08BE; // 0xBC30(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_297763CE476B45A47B6A4E9318EC8DE2; // 0xBC78(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A8DA905A4770592EF17394916A36E361; // 0xBCC0(0x0048)
	unsigned char                                      UnknownData_PO8T[0x8];                                     // 0xBD08(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_28AA5BDB4ECE1E934569C28A693F8D89; // 0xBD10(0x0280)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_11E5FA6245ADA0E6B064FAA86082A7DC; // 0xBF90(0x0280)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_530678734C14B71625C3F7B1472119D0; // 0xC210(0x0280)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DD4710FF45ECC08A3FDF16A167DF9370; // 0xC490(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1899EB9E4A029216B2A7839967E40EF4; // 0xC570(0x0048)
	float                                              OptinalAlphaOW;                                            // 0xC5B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass AB_C000.AB_C000_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_C000_AnimGraphNode_BlendListByEnum_6996576D4EDF58F3A89DB4A8FE1D7B3D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_C000_AnimGraphNode_BlendListByEnum_03CBC33C4BF76700EB3E4A8341242C6A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_C000_AnimGraphNode_BlendSpacePlayer_159B6E444443D4FE85A572926F3A71DF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_C000_AnimGraphNode_BlendSpacePlayer_71FC6A9541C8E72ECBB6C08418BCBC19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_C000_AnimGraphNode_BlendListByEnum_A9E51AF64EBFA42103A8D988756A15F1();
