#pragma once

// Name: DBZKakarot, Version: 1.0.3

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class AT.AccessPointBase
// 0x0088 (0x03C0 - 0x0338)
class AAccessPointBase : public AActor
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0338(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AccessPointBase");
		return ptr;
	}

};


// Class AT.AccessPointBaseComponent
// 0x0040 (0x05D0 - 0x0590)
class UAccessPointBaseComponent : public USphereComponent
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0590(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AccessPointBaseComponent");
		return ptr;
	}

};


// Class AT.AccessPointItemBase
// 0x0040 (0x0400 - 0x03C0)
class AAccessPointItemBase : public AAccessPointBase
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x03C0(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AccessPointItemBase");
		return ptr;
	}

};


// Class AT.ActorTrackingEffectComponent
// 0x00D0 (0x01D0 - 0x0100)
class UActorTrackingEffectComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x0100(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.ActorTrackingEffectComponent");
		return ptr;
	}

};


// Class AT.AG_DarkEffectNotifyState
// 0x0018 (0x0048 - 0x0030)
class UAG_DarkEffectNotifyState : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AG_DarkEffectNotifyState");
		return ptr;
	}

};


// Class AT.AG_PostEffectNotifyState
// 0x0038 (0x0068 - 0x0030)
class UAG_PostEffectNotifyState : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0030(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AG_PostEffectNotifyState");
		return ptr;
	}

};


// Class AT.AG_TimedParticleAnimNotifyState
// 0x00D8 (0x0108 - 0x0030)
class UAG_TimedParticleAnimNotifyState : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0xD8];                                      // 0x0030(0x00D8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AG_TimedParticleAnimNotifyState");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AG_Trail
// 0x0048 (0x0078 - 0x0030)
class UAnimNotifyState_AG_Trail : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0030(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AG_Trail");
		return ptr;
	}

};


// Class AT.AgreeKPI
// 0x0018 (0x0040 - 0x0028)
class UAgreeKPI : public UObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AgreeKPI");
		return ptr;
	}

};


// Class AT.AIBase
// 0x0118 (0x0218 - 0x0100)
class UAIBase : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x118];                                     // 0x0100(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AIBase");
		return ptr;
	}

};


// Class AT.AIManager
// 0x0200 (0x0300 - 0x0100)
class UAIManager : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x200];                                     // 0x0100(0x0200) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AIManager");
		return ptr;
	}

};


// Class AT.RideCharacterBase
// 0x00F0 (0x0840 - 0x0750)
class ARideCharacterBase : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0750(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.RideCharacterBase");
		return ptr;
	}

};


// Class AT.AirCar
// 0x0150 (0x0990 - 0x0840)
class AAirCar : public ARideCharacterBase
{
public:
	unsigned char                                      UnknownData00[0x150];                                     // 0x0840(0x0150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AirCar");
		return ptr;
	}

};


// Class AT.ATPlayerControllerBase
// 0x0030 (0x06B8 - 0x0688)
class AATPlayerControllerBase : public APlayerController
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0688(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.ATPlayerControllerBase");
		return ptr;
	}

};


// Class AT.RidePlayerControllerBase
// 0x0150 (0x0808 - 0x06B8)
class ARidePlayerControllerBase : public AATPlayerControllerBase
{
public:
	unsigned char                                      UnknownData00[0x150];                                     // 0x06B8(0x0150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.RidePlayerControllerBase");
		return ptr;
	}

};


// Class AT.AirCarController
// 0x0040 (0x0848 - 0x0808)
class AAirCarController : public ARidePlayerControllerBase
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0808(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AirCarController");
		return ptr;
	}

};


// Class AT.RideMoveStateBase
// 0x0000 (0x0100 - 0x0100)
class URideMoveStateBase : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.RideMoveStateBase");
		return ptr;
	}

};


// Class AT.AirCarMoveState
// 0x0148 (0x0248 - 0x0100)
class UAirCarMoveState : public URideMoveStateBase
{
public:
	unsigned char                                      UnknownData00[0x148];                                     // 0x0100(0x0148) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AirCarMoveState");
		return ptr;
	}

};


// Class AT.AirCarVirtualController
// 0x0010 (0x0110 - 0x0100)
class UAirCarVirtualController : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0100(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AirCarVirtualController");
		return ptr;
	}

};


// Class AT.AnimalAccessPoint
// 0x01C0 (0x0790 - 0x05D0)
class UAnimalAccessPoint : public UAccessPointBaseComponent
{
public:
	unsigned char                                      UnknownData00[0x1C0];                                     // 0x05D0(0x01C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalAccessPoint");
		return ptr;
	}

};


// Class AT.AnimalAccessPointSaveData
// 0x0008 (0x0030 - 0x0028)
class UAnimalAccessPointSaveData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalAccessPointSaveData");
		return ptr;
	}

};


// Class AT.AnimalCaptureManager
// 0x0098 (0x0198 - 0x0100)
class UAnimalCaptureManager : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x0100(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalCaptureManager");
		return ptr;
	}

};


// Class AT.NpcComponentBase
// 0x0360 (0x0460 - 0x0100)
class UNpcComponentBase : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x360];                                     // 0x0100(0x0360) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.NpcComponentBase");
		return ptr;
	}

};


// Class AT.AnimalComponentBase
// 0x0280 (0x06E0 - 0x0460)
class UAnimalComponentBase : public UNpcComponentBase
{
public:
	unsigned char                                      UnknownData00[0x280];                                     // 0x0460(0x0280) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalComponentBase");
		return ptr;
	}

};


// Class AT.AnimalSpawnerTargetPoint
// 0x0018 (0x0350 - 0x0338)
class AAnimalSpawnerTargetPoint : public ATargetPoint
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0338(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalSpawnerTargetPoint");
		return ptr;
	}

};


// Class AT.AnimalSpawnerVolumeBase
// 0x0040 (0x03B0 - 0x0370)
class AAnimalSpawnerVolumeBase : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0370(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalSpawnerVolumeBase");
		return ptr;
	}

};


// Class AT.AnimalSpawnerVolumeGround
// 0x0030 (0x03E0 - 0x03B0)
class AAnimalSpawnerVolumeGround : public AAnimalSpawnerVolumeBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x03B0(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalSpawnerVolumeGround");
		return ptr;
	}

};


// Class AT.AnimalSpawnerVolumeSky
// 0x0030 (0x03E0 - 0x03B0)
class AAnimalSpawnerVolumeSky : public AAnimalSpawnerVolumeBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x03B0(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimalSpawnerVolumeSky");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AG_Effect
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_AG_Effect : public UAnimNotifyState
{
public:
	struct FName                                       Name;                                                     // 0x0030(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AG_Effect");
		return ptr;
	}

};


// Class AT.AnimNotify_AG_WaterSurface
// 0x0030 (0x0068 - 0x0038)
class UAnimNotify_AG_WaterSurface : public UAnimNotifyState_AG_Effect
{
public:
	class UParticleSystem*                             ParticleSystem;                                           // 0x0038(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0040(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_AG_WaterSurface");
		return ptr;
	}

};


// Class AT.AnimNotify_BaitEffect
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_BaitEffect : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_BaitEffect");
		return ptr;
	}

};


// Class AT.AnimNotify_BaseballGame
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_BaseballGame : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_BaseballGame");
		return ptr;
	}

};


// Class AT.AnimNotify_BookAnimFinish
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_BookAnimFinish : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_BookAnimFinish");
		return ptr;
	}

};


// Class AT.AnimNotify_Buff
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_Buff : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Buff");
		return ptr;
	}

};


// Class AT.AnimNotify_BuffTeam
// 0x0000 (0x0048 - 0x0048)
class UAnimNotify_BuffTeam : public UAnimNotify_Buff
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_BuffTeam");
		return ptr;
	}

};


// Class AT.AnimNotify_ComboAssist
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_ComboAssist : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_ComboAssist");
		return ptr;
	}

};


// Class AT.AnimNotify_Cpl030AbsorbModeStart
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Cpl030AbsorbModeStart : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Cpl030AbsorbModeStart");
		return ptr;
	}

};


// Class AT.AnimNotify_Cpl071Summon
// 0x0020 (0x0058 - 0x0038)
class UAnimNotify_Cpl071Summon : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0038(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Cpl071Summon");
		return ptr;
	}

};


// Class AT.AnimNotify_DestroyProjectile
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_DestroyProjectile : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_DestroyProjectile");
		return ptr;
	}

};


// Class AT.AnimNotify_DestroyReplicatedCharacter
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_DestroyReplicatedCharacter : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_DestroyReplicatedCharacter");
		return ptr;
	}

};


// Class AT.AnimNotify_DirectDamage
// 0x0060 (0x0098 - 0x0038)
class UAnimNotify_DirectDamage : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0038(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_DirectDamage");
		return ptr;
	}

};


// Class AT.AnimNotify_DisableDelayDeathAction
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_DisableDelayDeathAction : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_DisableDelayDeathAction");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_EffectHide
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_EffectHide : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_EffectHide");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_EffectVisible
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_EffectVisible : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_EffectVisible");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_FailedReaction
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_FailedReaction : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_FailedReaction");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_FishAttach
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_Fishing_FishAttach : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_FishAttach");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_FishDetach
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_FishDetach : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_FishDetach");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_FishHide
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_FishHide : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_FishHide");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_FishVisible
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_FishVisible : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_FishVisible");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_QTE_Start
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_QTE_Start : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_QTE_Start");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_RodAttach
// 0x0028 (0x0060 - 0x0038)
class UAnimNotify_Fishing_RodAttach : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0038(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_RodAttach");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_RodDetach
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_RodDetach : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_RodDetach");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_RodHide
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_RodHide : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_RodHide");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_RodVisible
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_RodVisible : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_RodVisible");
		return ptr;
	}

};


// Class AT.AnimNotify_Fishing_StartReaction
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Fishing_StartReaction : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Fishing_StartReaction");
		return ptr;
	}

};


// Class AT.AnimNotify_Heal
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_Heal : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Heal");
		return ptr;
	}

};


// Class AT.AnimNotify_HealTeam
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_HealTeam : public UAnimNotify_Heal
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_HealTeam");
		return ptr;
	}

};


// Class AT.AnimNotify_PlaySkillMessage
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_PlaySkillMessage : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_PlaySkillMessage");
		return ptr;
	}

};


// Class AT.AnimNotify_Provocation
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_Provocation : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Provocation");
		return ptr;
	}

};


// Class AT.AnimNotify_Rage
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_Rage : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_Rage");
		return ptr;
	}

};


// Class AT.AnimNotify_SetCpl018SkillSpecial
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_SetCpl018SkillSpecial : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SetCpl018SkillSpecial");
		return ptr;
	}

};


// Class AT.AnimNotify_SetFacialByID
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_SetFacialByID : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SetFacialByID");
		return ptr;
	}

};


// Class AT.AnimNotify_SetMobCallBack
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_SetMobCallBack : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SetMobCallBack");
		return ptr;
	}

};


// Class AT.AnimNotify_SetNPAShockWave
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_SetNPAShockWave : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SetNPAShockWave");
		return ptr;
	}

};


// Class AT.AnimNotifyState_SpawnProjectileBase
// 0x0040 (0x0070 - 0x0030)
class UAnimNotifyState_SpawnProjectileBase : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0030(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_SpawnProjectileBase");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileBeam
// 0x0008 (0x0078 - 0x0070)
class UAnimNotify_SpawnProjectileBeam : public UAnimNotifyState_SpawnProjectileBase
{
public:
	class UClass*                                      Projectile;                                               // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileBeam");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileBeamHuge
// 0x0010 (0x0088 - 0x0078)
class UAnimNotify_SpawnProjectileBeamHuge : public UAnimNotify_SpawnProjectileBeam
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileBeamHuge");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileBase
// 0x0030 (0x0060 - 0x0030)
class UAnimNotify_SpawnProjectileBase : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0030(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileBase");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileBullet
// 0x0008 (0x0068 - 0x0060)
class UAnimNotify_SpawnProjectileBullet : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileBullet");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileCpl005LongRangeA
// 0x0020 (0x0050 - 0x0030)
class UAnimNotify_SpawnProjectileCpl005LongRangeA : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0030(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileCpl005LongRangeA");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileCpl058FloatMine
// 0x0018 (0x0078 - 0x0060)
class UAnimNotify_SpawnProjectileCpl058FloatMine : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0060(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileCpl058FloatMine");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileEnemyBullet
// 0x0038 (0x0098 - 0x0060)
class UAnimNotify_SpawnProjectileEnemyBullet : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0060(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileEnemyBullet");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileFieldShot
// 0x0018 (0x0078 - 0x0060)
class UAnimNotify_SpawnProjectileFieldShot : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0060(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileFieldShot");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileMine
// 0x0018 (0x0078 - 0x0060)
class UAnimNotify_SpawnProjectileMine : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0060(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileMine");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectilePattern
// 0x0028 (0x0088 - 0x0060)
class UAnimNotify_SpawnProjectilePattern : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0060(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectilePattern");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileRepeat
// 0x0060 (0x00C0 - 0x0060)
class UAnimNotify_SpawnProjectileRepeat : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0060(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileRepeat");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileReserved
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_SpawnProjectileReserved : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileReserved");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileRushBullet
// 0x0010 (0x0070 - 0x0060)
class UAnimNotify_SpawnProjectileRushBullet : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0060(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileRushBullet");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileSlashWave
// 0x0030 (0x0090 - 0x0060)
class UAnimNotify_SpawnProjectileSlashWave : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0060(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileSlashWave");
		return ptr;
	}

};


// Class AT.AnimNotify_SpawnProjectileWideShot
// 0x0020 (0x0080 - 0x0060)
class UAnimNotify_SpawnProjectileWideShot : public UAnimNotify_SpawnProjectileBase
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0060(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SpawnProjectileWideShot");
		return ptr;
	}

};


// Class AT.AnimNotify_SummonCharacter
// 0x0018 (0x0050 - 0x0038)
class UAnimNotify_SummonCharacter : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_SummonCharacter");
		return ptr;
	}

};


// Class AT.AnimNotify_TeleportToRoot
// 0x0018 (0x0050 - 0x0038)
class UAnimNotify_TeleportToRoot : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_TeleportToRoot");
		return ptr;
	}

};


// Class AT.AnimNotify_TeleportToTarget
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_TeleportToTarget : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotify_TeleportToTarget");
		return ptr;
	}

};


// Class AT.AnimNotifyState_Absorb
// 0x00A0 (0x00D0 - 0x0030)
class UAnimNotifyState_Absorb : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0030(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_Absorb");
		return ptr;
	}

};


// Class AT.AnimNotifyState_CharacterEffect
// 0x0018 (0x0050 - 0x0038)
class UAnimNotifyState_CharacterEffect : public UAnimNotifyState_AG_Effect
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_CharacterEffect");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AG_CharacterTrail
// 0x0030 (0x0068 - 0x0038)
class UAnimNotifyState_AG_CharacterTrail : public UAnimNotifyState_AG_Effect
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0038(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AG_CharacterTrail");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AG_EF_Particle
// 0x0030 (0x0068 - 0x0038)
class UAnimNotifyState_AG_EF_Particle : public UAnimNotifyState_AG_Effect
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0038(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AG_EF_Particle");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AG_FootEffect
// 0x00F8 (0x0130 - 0x0038)
class UAnimNotifyState_AG_FootEffect : public UAnimNotifyState_AG_Effect
{
public:
	class UDataTable*                                  LandEffectSetting;                                        // 0x0038(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0040(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AG_FootEffect");
		return ptr;
	}

};


// Class AT.AnimNotifyState_Attack
// 0x0100 (0x0130 - 0x0030)
class UAnimNotifyState_Attack : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x100];                                     // 0x0030(0x0100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_Attack");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AttackMulti
// 0x0008 (0x0138 - 0x0130)
class UAnimNotifyState_AttackMulti : public UAnimNotifyState_Attack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0130(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AttackMulti");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AttackCapsule
// 0x0008 (0x0138 - 0x0130)
class UAnimNotifyState_AttackCapsule : public UAnimNotifyState_Attack
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0130(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AttackCapsule");
		return ptr;
	}

};


// Class AT.AnimNotifyState_AttackCapsuleMulti
// 0x0008 (0x0140 - 0x0138)
class UAnimNotifyState_AttackCapsuleMulti : public UAnimNotifyState_AttackCapsule
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0138(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_AttackCapsuleMulti");
		return ptr;
	}

};


// Class AT.AnimNotifyState_C002Z_B02_SKL001
// 0x0010 (0x0088 - 0x0078)
class UAnimNotifyState_C002Z_B02_SKL001 : public UAnimNotify_SpawnProjectileBeam
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_C002Z_B02_SKL001");
		return ptr;
	}

};


// Class AT.AnimNotifyState_CKG_HiddenAttach
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_CKG_HiddenAttach : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_CKG_HiddenAttach");
		return ptr;
	}

};


// Class AT.AnimNotifyState_CollectiveWarp
// 0x0078 (0x00A8 - 0x0030)
class UAnimNotifyState_CollectiveWarp : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0030(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_CollectiveWarp");
		return ptr;
	}

};


// Class AT.AnimNotifyState_Cpl024ShortRange
// 0x0058 (0x0088 - 0x0030)
class UAnimNotifyState_Cpl024ShortRange : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_Cpl024ShortRange");
		return ptr;
	}

};


// Class AT.AnimNotifyState_Cpl034SonicBlow
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_Cpl034SonicBlow : public UAnimNotifyState
{
public:
	float                                              Speed;                                                    // 0x0030(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0034(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_Cpl034SonicBlow");
		return ptr;
	}

};


// Class AT.AnimNotifyState_DirectionCamera
// 0x0048 (0x0078 - 0x0030)
class UAnimNotifyState_DirectionCamera : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0030(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_DirectionCamera");
		return ptr;
	}

};


// Class AT.AnimNotifyState_DisableBodyCollision
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_DisableBodyCollision : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_DisableBodyCollision");
		return ptr;
	}

};


// Class AT.AnimNotifyState_PlayParticleBeam
// 0x0190 (0x01C0 - 0x0030)
class UAnimNotifyState_PlayParticleBeam : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x190];                                     // 0x0030(0x0190) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_PlayParticleBeam");
		return ptr;
	}

};


// Class AT.AnimNotifyState_RadialBlur
// 0x0028 (0x0058 - 0x0030)
class UAnimNotifyState_RadialBlur : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0030(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_RadialBlur");
		return ptr;
	}

};


// Class AT.AnimNotifyState_SensingVolume
// 0x0028 (0x0058 - 0x0030)
class UAnimNotifyState_SensingVolume : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0030(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_SensingVolume");
		return ptr;
	}

};


// Class AT.AnimNotifyState_SetMobAction
// 0x0038 (0x0068 - 0x0030)
class UAnimNotifyState_SetMobAction : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0030(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_SetMobAction");
		return ptr;
	}

};


// Class AT.AnimNotifyState_ShotComboInvalid
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_ShotComboInvalid : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_ShotComboInvalid");
		return ptr;
	}

};


// Class AT.AnimNotifyState_TargetCamera
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_TargetCamera : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_TargetCamera");
		return ptr;
	}

};


// Class AT.AnimNotifyState_TeleportToTarget
// 0x0058 (0x0088 - 0x0030)
class UAnimNotifyState_TeleportToTarget : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_TeleportToTarget");
		return ptr;
	}

};


// Class AT.AnimNotifyState_Turn
// 0x0038 (0x0068 - 0x0030)
class UAnimNotifyState_Turn : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0030(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_Turn");
		return ptr;
	}

};


// Class AT.AnimNotifyState_UseRetargetSetting
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_UseRetargetSetting : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyState_UseRetargetSetting");
		return ptr;
	}

};


// Class AT.AnimNotifySubTitle
// 0x0018 (0x0050 - 0x0038)
class UAnimNotifySubTitle : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifySubTitle");
		return ptr;
	}

};


// Class AT.AnimNotifyTreasureItemSpawn
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyTreasureItemSpawn : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AnimNotifyTreasureItemSpawn");
		return ptr;
	}

};


// Class AT.AreaBoundsVolume
// 0x0010 (0x0380 - 0x0370)
class AAreaBoundsVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0370(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AreaBoundsVolume");
		return ptr;
	}

};


// Class AT.AT_AnimInstance
// 0x0060 (0x03C0 - 0x0360)
class UAT_AnimInstance : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0360(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_AnimInstance");
		return ptr;
	}

};


// Class AT.AT_AnimNotifyState_ChickenEgg
// 0x0010 (0x0040 - 0x0030)
class UAT_AnimNotifyState_ChickenEgg : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_AnimNotifyState_ChickenEgg");
		return ptr;
	}

};


// Class AT.AT_AnimNotifyState_ToAccessPoint
// 0x0000 (0x0030 - 0x0030)
class UAT_AnimNotifyState_ToAccessPoint : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_AnimNotifyState_ToAccessPoint");
		return ptr;
	}

};


// Class AT.AT_AnimNotifyState_ToTreasureAP
// 0x0000 (0x0030 - 0x0030)
class UAT_AnimNotifyState_ToTreasureAP : public UAT_AnimNotifyState_ToAccessPoint
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_AnimNotifyState_ToTreasureAP");
		return ptr;
	}

};


// Class AT.AT_BaseHUD
// 0x0028 (0x0508 - 0x04E0)
class AAT_BaseHUD : public ACFHUD
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x04E0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_BaseHUD");
		return ptr;
	}


	void CanvasSize();
};


// Class AT.AT_BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAT_BlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_BlueprintFunctionLibrary");
		return ptr;
	}


	void STATIC_UnloadUiCaptureById();
	void STATIC_UnloadUiCaptureByCharacter();
	void STATIC_StopBgm();
	void STATIC_StartTrialClearMenu();
	void STATIC_StartQuest();
	void STATIC_SetScreenResolution(int Width, int Height);
	void STATIC_SetKeyGuideType();
	void STATIC_SetKeyGuideTutorialSetting();
	void STATIC_SetKeyGuideCtrlMode();
	void STATIC_SetFieldRideSelectBlock();
	void STATIC_ResumeAllParticle();
	void STATIC_RequestLoadUiCaptureById();
	void STATIC_RequestLoadUiCaptureByCharacter();
	void STATIC_RequestInDisplayPopularNameUI();
	void STATIC_RequestInDisplayNameUI();
	void STATIC_ReplaceTxtMacro();
	void STATIC_ReplaceIntegerMacro();
	void STATIC_ReplaceFloatMacro();
	void STATIC_ReleaseCooking();
	void STATIC_Progress_Set(const struct FName& Name);
	void STATIC_Progress_Next();
	void STATIC_Progress_GetName();
	void STATIC_Progress_DebugSet(const struct FName& Name);
	void STATIC_PlayBgm(const struct FName& ID);
	void STATIC_PhaseID2QuestID();
	void STATIC_PermissionSkill();
	void STATIC_PauseMenu();
	void STATIC_PauseMainQuestTitleAnim();
	void STATIC_PauseAllParticle();
	void STATIC_OpenItemMenuByTutorialMode();
	void STATIC_OpenCookingMenuChichiActorName();
	void STATIC_OpenCookingMenuChichi();
	void STATIC_OpenCommunityMenuByTutorialMode();
	void STATIC_LockCooking();
	void STATIC_isFlagOn(int Source, int Enum);
	void STATIC_HideKeyGuideUntilQuestCaption();
	void STATIC_GetSkyLights();
	void STATIC_GetSkyConditionManager();
	void STATIC_GetRideManager();
	void STATIC_GetRaceGameManager();
	void STATIC_GetQuestManager();
	void STATIC_GetHeightFogs();
	void STATIC_GetDragonBallManager();
	void STATIC_GetDemoManageComponent();
	void STATIC_GetDefaultGameHud();
	void STATIC_GetDebugMenu();
	void STATIC_GetCharacterName(const struct FString& ID);
	void STATIC_GetCaptureManager();
	void STATIC_GetBuildConfiguration();
	void STATIC_GetBaseballGameManager();
	void STATIC_GetATVersion();
	void STATIC_GetAtmosphericFogs();
	void STATIC_GetATCharacterByType( Type);
	void STATIC_GetATCharacter();
	void STATIC_GetAIManager();
	void STATIC_GetAIBase();
	void STATIC_GetActorByTag();
	void STATIC_GetActorByClassTag(class UClass* Class);
	void STATIC_GetActor();
	void STATIC_ForceRequestOutDisplayNameUI();
	void STATIC_EnumToBitFlag(int Enum);
	void STATIC_EnableDepthOfField();
	void STATIC_DebugUnlockAllArea();
	void STATIC_ClearBannedSkillSetting();
	void STATIC_CallTutorialTips_IN();
	void STATIC_CallTutorialTips_CONTROL(int Input);
	void STATIC_CallMainQuestEnd_IN();
	void STATIC_CallMainQuestEnd_CONTROL(int Input);
	void STATIC_CallMainQuestBegin_OUT();
	void STATIC_CallMainQuestBegin_IN();
	void STATIC_CallFavorRateUp_IN(int Target);
	void STATIC_CallFavorRateUp_CONTROL(int Input);
	void STATIC_CallBossBattleResult();
	void STATIC_BannedAndRipoffSkill();
};


// Class AT.AT_BlurManager
// 0x0078 (0x03B0 - 0x0338)
class AAT_BlurManager : public AActor
{
public:
	class UMaterial*                                   Material;                                                 // 0x0338(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x70];                                      // 0x0340(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_BlurManager");
		return ptr;
	}

};


// Class AT.AT_CapturedCharacterAnimInstance
// 0x0020 (0x0380 - 0x0360)
class UAT_CapturedCharacterAnimInstance : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0360(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_CapturedCharacterAnimInstance");
		return ptr;
	}

};


// Class AT.AT_CharacterBase
// 0x0170 (0x08C0 - 0x0750)
class AAT_CharacterBase : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0x170];                                     // 0x0750(0x0170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_CharacterBase");
		return ptr;
	}

};


// Class AT.AT_Character
// 0x06E0 (0x0FA0 - 0x08C0)
class AAT_Character : public AAT_CharacterBase
{
public:
	unsigned char                                      UnknownData00[0x6E0];                                     // 0x08C0(0x06E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_Character");
		return ptr;
	}

};


// Class AT.AT_CharacterHugeBase
// 0x0010 (0x0FB0 - 0x0FA0)
class AAT_CharacterHugeBase : public AAT_Character
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0FA0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_CharacterHugeBase");
		return ptr;
	}

};


// Class AT.AT_CharacterPlayableBase
// 0x0000 (0x0FA0 - 0x0FA0)
class AAT_CharacterPlayableBase : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_CharacterPlayableBase");
		return ptr;
	}

};


// Class AT.SupportActionInfo
// 0x00B8 (0x00E0 - 0x0028)
class USupportActionInfo : public UObject
{
public:
	class UDataTable*                                  CharacterSupportParameter;                                // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0030(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.SupportActionInfo");
		return ptr;
	}

};


// Class AT.ATCorrectionFlySpeedComponent
// 0x0018 (0x0118 - 0x0100)
class UATCorrectionFlySpeedComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0100(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.ATCorrectionFlySpeedComponent");
		return ptr;
	}

};


// Class AT.ATDamageCollisionBase
// 0x0230 (0x0570 - 0x0340)
class AATDamageCollisionBase : public ATriggerBase
{
public:
	unsigned char                                      UnknownData00[0x230];                                     // 0x0340(0x0230) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.ATDamageCollisionBase");
		return ptr;
	}


	void EndOverlap();
	void BeginOverlap();
};


// Class AT.AT_DamageCollisionBox
// 0x0000 (0x0570 - 0x0570)
class AAT_DamageCollisionBox : public AATDamageCollisionBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_DamageCollisionBox");
		return ptr;
	}

};


// Class AT.AT_DamageCollisionCapsule
// 0x0000 (0x0570 - 0x0570)
class AAT_DamageCollisionCapsule : public AATDamageCollisionBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_DamageCollisionCapsule");
		return ptr;
	}

};


// Class AT.AT_DamageCollisionSphere
// 0x0000 (0x0570 - 0x0570)
class AAT_DamageCollisionSphere : public AATDamageCollisionBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_DamageCollisionSphere");
		return ptr;
	}

};


// Class AT.AT_DamageExpCharacter
// 0x00A0 (0x07F0 - 0x0750)
class AAT_DamageExpCharacter : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0750(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_DamageExpCharacter");
		return ptr;
	}

};


// Class AT.AT_DamageType
// 0x0030 (0x0070 - 0x0040)
class UAT_DamageType : public UDamageType
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0040(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_DamageType");
		return ptr;
	}

};


// Class AT.AT_DepthOfFieldManager
// 0x0000 (0x0100 - 0x0100)
class UAT_DepthOfFieldManager : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_DepthOfFieldManager");
		return ptr;
	}


	void OnDemoTiming();
};


// Class AT.AT_DPICustomScalingRule
// 0x0000 (0x0028 - 0x0028)
class UAT_DPICustomScalingRule : public UDPICustomScalingRule
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_DPICustomScalingRule");
		return ptr;
	}

};


// Class AT.AT_EffectStatics
// 0x0008 (0x0108 - 0x0100)
class UAT_EffectStatics : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0100(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_EffectStatics");
		return ptr;
	}


	void STATIC_TickTrail();
	void STATIC_IsNearlyGround(class AActor* Character);
	void STATIC_IsNearly(class AActor* Character);
	void STATIC_IsNearCamera();
	void STATIC_EnlargeEffect();
	void STATIC_EndTrail();
	void STATIC_DrawPhysicalSurfaceDebug(class AActor* Character);
	void STATIC_CallHitEffectCPP();
	void STATIC_CallGuardHitEffectCPP();
	void STATIC_BeginTrail();
};


// Class AT.AT_GameHUD
// 0x0110 (0x0618 - 0x0508)
class AAT_GameHUD : public AAT_BaseHUD
{
public:
	unsigned char                                      UnknownData00[0x110];                                     // 0x0508(0x0110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_GameHUD");
		return ptr;
	}

};


// Class AT.AT_GameInstance
// 0x0228 (0x04C0 - 0x0298)
class UAT_GameInstance : public UCFGameInstance
{
public:
	unsigned char                                      UnknownData00[0x228];                                     // 0x0298(0x0228) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_GameInstance");
		return ptr;
	}

};


// Class AT.AT_LightTowerEffectComponent
// 0x0198 (0x0298 - 0x0100)
class UAT_LightTowerEffectComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x198];                                     // 0x0100(0x0198) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_LightTowerEffectComponent");
		return ptr;
	}

};


// Class AT.AT_Logo
// 0x0100 (0x0438 - 0x0338)
class AAT_Logo : public AActor
{
public:
	unsigned char                                      UnknownData00[0x100];                                     // 0x0338(0x0100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_Logo");
		return ptr;
	}

};


// Class AT.AT_LookAtInterface
// 0x0000 (0x0028 - 0x0028)
class UAT_LookAtInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_LookAtInterface");
		return ptr;
	}

};


// Class AT.NpcPawn
// 0x0000 (0x0398 - 0x0398)
class ANpcPawn : public APawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.NpcPawn");
		return ptr;
	}


	void GetNpcMovementComponent();
};


// Class AT.AT_MobBase
// 0x0068 (0x0400 - 0x0398)
class AAT_MobBase : public ANpcPawn
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0398(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_MobBase");
		return ptr;
	}

};


// Class AT.AT_MobAnimalBase
// 0x0050 (0x0450 - 0x0400)
class AAT_MobAnimalBase : public AAT_MobBase
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0400(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_MobAnimalBase");
		return ptr;
	}

};


// Class AT.AT_MobBase_Static
// 0x0008 (0x0408 - 0x0400)
class AAT_MobBase_Static : public AAT_MobBase
{
public:
	class UStaticMeshComponent*                        StaticMesh;                                               // 0x0400(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_MobBase_Static");
		return ptr;
	}

};


// Class AT.AT_MobCharacter
// 0x0000 (0x0750 - 0x0750)
class AAT_MobCharacter : public ACharacter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_MobCharacter");
		return ptr;
	}


	void CreateMessageWindow();
};


// Class AT.AT_MonitoringMouse
// 0x0010 (0x0038 - 0x0028)
class UAT_MonitoringMouse : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_MonitoringMouse");
		return ptr;
	}

};


// Class AT.AT_MotionMetaData
// 0x0020 (0x0048 - 0x0028)
class UAT_MotionMetaData : public UAnimMetaData
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0028(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AT.AT_MotionMetaData");
		return ptr;
	}

};


// Class AT.AT_Opening
// 0x0008 (0x0340 - 0x0338)
class AAT_Opening : public AActor
{
public:
