#pragma once

// Name: DBZKakarot, Version: 1.0.3

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct AT.LoadingBaseballGameAsset
// 0x0028
struct FLoadingBaseballGameAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingBattleAIAsset
// 0x0050
struct FLoadingBattleAIAsset
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct AT.LoadingBattleGroupAIAsset
// 0x0028
struct FLoadingBattleGroupAIAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingCharacterActionAsset
// 0x0028
struct FLoadingCharacterActionAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingCharacterAsset
// 0x0028
struct FLoadingCharacterAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty AT.LoadingCharacterAsset.Character
};

// ScriptStruct AT.ATLoadingVariationMeshAsset
// 0x0030
struct FATLoadingVariationMeshAsset
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.ATLoadingFormMeshAsset
// 0x0030
struct FATLoadingFormMeshAsset
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.ATLoadingCookingDemoCharacterResourceAsset
// 0x02D8
struct FATLoadingCookingDemoCharacterResourceAsset
{
	unsigned char                                      UnknownData00[0x2D8];                                     // 0x0000(0x02D8) MISSED OFFSET
};

// ScriptStruct AT.LoadingCrossTalkAsset
// 0x0038
struct FLoadingCrossTalkAsset
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.LoadingDamageTypeAsset
// 0x0028
struct FLoadingDamageTypeAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty AT.LoadingDamageTypeAsset.DamageType
};

// ScriptStruct AT.LoadingEventBattleAsset
// 0x0028
struct FLoadingEventBattleAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.ATLoadingFacialAsset
// 0x0030
struct FATLoadingFacialAsset
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.LoadingFishGameMeshAsset
// 0x0050
struct FLoadingFishGameMeshAsset
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct AT.LoadingItemAsset
// 0x0001
struct FLoadingItemAsset
{
	unsigned char                                      UnknownData00[0x1];                                       // 0x0000(0x0001) MISSED OFFSET
};

// ScriptStruct AT.LoadingJostleBeamAsset
// 0x0028
struct FLoadingJostleBeamAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty AT.LoadingJostleBeamAsset.ATJostleBeamParam
};

// ScriptStruct AT.LoadingMechaDevAsset
// 0x0028
struct FLoadingMechaDevAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty AT.LoadingMechaDevAsset.Object
};

// ScriptStruct AT.LoadingMiniGameAsset
// 0x0028
struct FLoadingMiniGameAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingParticleAsset
// 0x0028
struct FLoadingParticleAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty AT.LoadingParticleAsset.ParticleSystem
};

// ScriptStruct AT.LoadingQuestAsset
// 0x0028
struct FLoadingQuestAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty AT.LoadingQuestAsset.DataTable
};

// ScriptStruct AT.LoadingRaceGameAsset
// 0x0028
struct FLoadingRaceGameAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingSoundAsset
// 0x0028
struct FLoadingSoundAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingStarScaleFinishAsset
// 0x0028
struct FLoadingStarScaleFinishAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingSupportCharacterTalkAsset
// 0x0028
struct FLoadingSupportCharacterTalkAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.LoadingTPSSkillViewCancelAsset
// 0x0028
struct FLoadingTPSSkillViewCancelAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty AT.LoadingTPSSkillViewCancelAsset.TPSSkillViewCancelDataTable
};

// ScriptStruct AT.LoadingAsset
// 0x0050
struct FLoadingAsset
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct AT.LoadingUiCaptureAsset
// 0x0100
struct FLoadingUiCaptureAsset
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty AT.LoadingUiCaptureAsset.StaticMesh
	unsigned char                                      UnknownData01[0xD8];                                      // 0x0028(0x00D8) MISSED OFFSET
};

// ScriptStruct AT.ATLevelEventParam
// 0x0020
struct FATLevelEventParam
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.PlaceObjectPatternTableRow
// 0x0038 (0x0040 - 0x0008)
struct FPlaceObjectPatternTableRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0008(0x0038) MISSED OFFSET
};

// ScriptStruct AT.TelopInfo
// 0x0028
struct FTelopInfo
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.EventParam
// 0x0108
struct FEventParam
{
	unsigned char                                      UnknownData00[0x108];                                     // 0x0000(0x0108) MISSED OFFSET
};

// ScriptStruct AT.GrassData
// 0x0040
struct FGrassData
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0000(0x0040) MISSED OFFSET
};

// ScriptStruct AT.MinigameTimingArgment
// 0x0018
struct FMinigameTimingArgment
{
	                                                   State;                                                    // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0001(0x0017) MISSED OFFSET
};

// ScriptStruct AT.DirectionParameter
// 0x0040
struct FDirectionParameter
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0000(0x0040) MISSED OFFSET
};

// ScriptStruct AT.TrackingEffect
// 0x0010
struct FTrackingEffect
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.ColorGrading
// 0x0018
struct FColorGrading
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.LandEffect
// 0x0010
struct FLandEffect
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.AI_ActionTbl
// 0x0038
struct FAI_ActionTbl
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.AI_BehaviorTbl
// 0x001C
struct FAI_BehaviorTbl
{
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0000(0x001C) MISSED OFFSET
};

// ScriptStruct AT.AI_PHEASE
// 0x001C
struct FAI_PHEASE
{
	unsigned char                                      Number;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1B];                                      // 0x0001(0x001B) MISSED OFFSET
};

// ScriptStruct AT.EnemyParamDistRelationTbl
// 0x0038 (0x0040 - 0x0008)
struct FEnemyParamDistRelationTbl : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0008(0x0038) MISSED OFFSET
};

// ScriptStruct AT.MoveDistanceTbl
// 0x0010 (0x0018 - 0x0008)
struct FMoveDistanceTbl : public FTableRowBase
{
	float                                              Speed;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x000C(0x000C) MISSED OFFSET
};

// ScriptStruct AT.MoveForwardTbl
// 0x0010 (0x0018 - 0x0008)
struct FMoveForwardTbl : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct AT.MoveAroundTbl
// 0x0028 (0x0030 - 0x0008)
struct FMoveAroundTbl : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) MISSED OFFSET
};

// ScriptStruct AT.AI_TPSActionBehaviorTbl
// 0x0038 (0x0040 - 0x0008)
struct FAI_TPSActionBehaviorTbl : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0008(0x0038) MISSED OFFSET
};

// ScriptStruct AT.SpawnList
// 0x0050
struct FSpawnList
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct AT.SpawnParam
// 0x0018
struct FSpawnParam
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.AnimalParam
// 0x0018 (0x0020 - 0x0008)
struct FAnimalParam : public FTableRowBase
{
	struct FName                                       Name;                                                     // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0010(0x0010) MISSED OFFSET
};

// ScriptStruct AT.AnimalSpawnSettingData
// 0x0020
struct FAnimalSpawnSettingData
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.AnimalSpawnSettingData_Sky
// 0x0000 (0x0020 - 0x0020)
struct FAnimalSpawnSettingData_Sky : public FAnimalSpawnSettingData
{

};

// ScriptStruct AT.AnimNode_LookAtEyeBlend
// 0x0128 (0x0180 - 0x0058)
struct FAnimNode_LookAtEyeBlend : public FAnimNode_AssetPlayerBase
{
	struct FPoseLink                                   BasePose;                                                 // 0x0058(0x0010) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x118];                                     // 0x0068(0x0118) MISSED OFFSET
};

// ScriptStruct AT.ProjectileLaunchPattern
// 0x0010
struct FProjectileLaunchPattern
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.ProjectileLaunchData
// 0x0010
struct FProjectileLaunchData
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.CharacterEffectSetting
// 0x0058 (0x0060 - 0x0008)
struct FCharacterEffectSetting : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0008(0x0058) MISSED OFFSET
};

// ScriptStruct AT.EffectBaseData
// 0x0018
struct FEffectBaseData
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.EffectData
// 0x0028 (0x0040 - 0x0018)
struct FEffectData : public FEffectBaseData
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0018(0x0028) MISSED OFFSET
};

// ScriptStruct AT.EF_ParticleData
// 0x0010 (0x0050 - 0x0040)
struct FEF_ParticleData : public FEffectData
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET
};

// ScriptStruct AT.EF_TrailParticleData
// 0x0058 (0x0060 - 0x0008)
struct FEF_TrailParticleData : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0008(0x0058) MISSED OFFSET
};

// ScriptStruct AT.TrailData
// 0x0028 (0x0040 - 0x0018)
struct FTrailData : public FEffectBaseData
{
	class UParticleSystem*                             ParticleSystem;                                           // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0020(0x0020) MISSED OFFSET
};

// ScriptStruct AT.EffectConditionData
// 0x0002
struct FEffectConditionData
{
	unsigned char                                      UnknownData00[0x2];                                       // 0x0000(0x0002) MISSED OFFSET
};

// ScriptStruct AT.LandEffectSetting
// 0x0058 (0x0060 - 0x0008)
struct FLandEffectSetting : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0008(0x0058) MISSED OFFSET
};

// ScriptStruct AT.DirectionalLights
// 0x0010
struct FDirectionalLights
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.RadialBlurParam
// 0x0050
struct FRadialBlurParam
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct AT.ATCharacterTickFunction
// 0x0028 (0x0080 - 0x0058)
struct FATCharacterTickFunction : public FActorTickFunction
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0058(0x0028) MISSED OFFSET
};

// ScriptStruct AT.CharacterOffsetSetting
// 0x0020 (0x0028 - 0x0008)
struct FCharacterOffsetSetting : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct AT.AT_CharacterCameraParam
// 0x0030 (0x0038 - 0x0008)
struct FAT_CharacterCameraParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.AT_CharacterConstParam
// 0x0008 (0x0010 - 0x0008)
struct FAT_CharacterConstParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.SkillAssistTable
// 0x0008 (0x0010 - 0x0008)
struct FSkillAssistTable : public FTableRowBase
{
	int                                                Priority;                                                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct AT.SkillAssistTriggerTable
// 0x0008 (0x0010 - 0x0008)
struct FSkillAssistTriggerTable : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.SupportRecoveryMpParameter
// 0x000C
struct FSupportRecoveryMpParameter
{
	unsigned char                                      UnknownData00[0xC];                                       // 0x0000(0x000C) MISSED OFFSET
};

// ScriptStruct AT.SupportRecoveryHpParameter
// 0x000C
struct FSupportRecoveryHpParameter
{
	unsigned char                                      UnknownData00[0xC];                                       // 0x0000(0x000C) MISSED OFFSET
};

// ScriptStruct AT.SupportStyleParameter
// 0x0010
struct FSupportStyleParameter
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.SupportActionParameter
// 0x0010
struct FSupportActionParameter
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.CharacterSupportParameter
// 0x0020 (0x0028 - 0x0008)
struct FCharacterSupportParameter : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct AT.ATGameHUDSettings
// 0x0028
struct FATGameHUDSettings
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty AT.ATGameHUDSettings.Class
};

// ScriptStruct AT.ATPreLoadFile
// 0x0018 (0x0020 - 0x0008)
struct FATPreLoadFile : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct AT.ATDefaultInputAssignParam
// 0x0048 (0x0050 - 0x0008)
struct FATDefaultInputAssignParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0008(0x0048) MISSED OFFSET
};

// ScriptStruct AT.LightTowerSetting
// 0x0028 (0x0030 - 0x0008)
struct FLightTowerSetting : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) MISSED OFFSET
};

// ScriptStruct AT.ParticleRefs
// 0x0020
struct FParticleRefs
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.TransformFaceInfo
// 0x0010
struct FTransformFaceInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.Hit
// 0x0090
struct FHit
{
	struct FHitResult                                  HitResult;                                                // 0x0000(0x0088) (BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0088(0x0008) MISSED OFFSET
};

// ScriptStruct AT.CharacterName
// 0x0010 (0x0018 - 0x0008)
struct FCharacterName : public FTableRowBase
{
	struct FString                                     CharacterName;                                            // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct AT.FloatTableRow
// 0x0008 (0x0010 - 0x0008)
struct FFloatTableRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.CharacterUIParamTableRow
// 0x0010 (0x0018 - 0x0008)
struct FCharacterUIParamTableRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct AT.StatusTableRow
// 0x0060 (0x0068 - 0x0008)
struct FStatusTableRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0008(0x0060) MISSED OFFSET
};

// ScriptStruct AT.AT_TableRow_Float
// 0x0008 (0x0010 - 0x0008)
struct FAT_TableRow_Float : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.AT_TalkAnimNode_LookAt
// 0x0060 (0x0280 - 0x0220)
struct FAT_TalkAnimNode_LookAt : public FAnimNode_LookAt
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0220(0x0060) MISSED OFFSET
};

// ScriptStruct AT.LoadingTipsTableRow
// 0x0030 (0x0038 - 0x0008)
struct FLoadingTipsTableRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.QuestProgressTextureTableRow
// 0x0030 (0x0038 - 0x0008)
struct FQuestProgressTextureTableRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.CmnTabIconParam
// 0x0002
struct FCmnTabIconParam
{
	unsigned char                                      UnknownData00[0x2];                                       // 0x0000(0x0002) MISSED OFFSET
};

// ScriptStruct AT.CommandPaletteBase
// 0x0003
struct FCommandPaletteBase
{
	unsigned char                                      UnknownData00[0x3];                                       // 0x0000(0x0003) MISSED OFFSET
};

// ScriptStruct AT.CommandPaletteSkill
// 0x002D (0x0030 - 0x0003)
struct FCommandPaletteSkill : public FCommandPaletteBase
{
	unsigned char                                      UnknownData00[0x2D];                                      // 0x0003(0x002D) MISSED OFFSET
};

// ScriptStruct AT.CommandPaletteFormChange
// 0x0008 (0x0038 - 0x0030)
struct FCommandPaletteFormChange : public FCommandPaletteSkill
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
};

// ScriptStruct AT.CommandPaletteItem
// 0x0025 (0x0028 - 0x0003)
struct FCommandPaletteItem : public FCommandPaletteBase
{
	unsigned char                                      UnknownData00[0x25];                                      // 0x0003(0x0025) MISSED OFFSET
};

// ScriptStruct AT.CommandPaletteSupport
// 0x007D (0x0080 - 0x0003)
struct FCommandPaletteSupport : public FCommandPaletteBase
{
	unsigned char                                      UnknownData00[0x7D];                                      // 0x0003(0x007D) MISSED OFFSET
};

// ScriptStruct AT.CommandPaletteSupportSkill
// 0x002D (0x0030 - 0x0003)
struct FCommandPaletteSupportSkill : public FCommandPaletteBase
{
	unsigned char                                      UnknownData00[0x2D];                                      // 0x0003(0x002D) MISSED OFFSET
};

// ScriptStruct AT.CommandPaletteRoot
// 0x0015 (0x0018 - 0x0003)
struct FCommandPaletteRoot : public FCommandPaletteBase
{
	unsigned char                                      UnknownData00[0x15];                                      // 0x0003(0x0015) MISSED OFFSET
};

// ScriptStruct AT.LinkPanelInfo
// 0x0010
struct FLinkPanelInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.AT_UICompZListParam
// 0x0030
struct FAT_UICompZListParam
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.AT_UICompZListBgmParam
// 0x0028
struct FAT_UICompZListBgmParam
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.AT_UICompZListCardParam
// 0x0048
struct FAT_UICompZListCardParam
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0000(0x0048) MISSED OFFSET
};

// ScriptStruct AT.AT_UICompZListDemoParam
// 0x0048
struct FAT_UICompZListDemoParam
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0000(0x0048) MISSED OFFSET
};

// ScriptStruct AT.CookTextBarInfo
// 0x0068
struct FCookTextBarInfo
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0000(0x0068) MISSED OFFSET
};

// ScriptStruct AT.FoodWidgetInfo
// 0x0040
struct FFoodWidgetInfo
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0000(0x0040) MISSED OFFSET
};

// ScriptStruct AT.RecipeInfo
// 0x0020
struct FRecipeInfo
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.DamagePopPlayInfo
// 0x0038
struct FDamagePopPlayInfo
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.EnemyGaugeNumInfo
// 0x0008 (0x0010 - 0x0008)
struct FEnemyGaugeNumInfo : public FTableRowBase
{
	                                                   Type;                                                     // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct AT.Credit
// 0x0030 (0x0038 - 0x0008)
struct FCredit : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.LinkBonusVoiceProgress
// 0x0060 (0x0068 - 0x0008)
struct FLinkBonusVoiceProgress : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0008(0x0060) MISSED OFFSET
};

// ScriptStruct AT.LinkBonusVoice
// 0x0060 (0x0068 - 0x0008)
struct FLinkBonusVoice : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0008(0x0060) MISSED OFFSET
};

// ScriptStruct AT.WorldMapMaterialInfo
// 0x0018 (0x0020 - 0x0008)
struct FWorldMapMaterialInfo : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct AT.WorldMapActiveParamRow
// 0x0008 (0x0010 - 0x0008)
struct FWorldMapActiveParamRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.KeyGuideListParam
// 0x0010 (0x0018 - 0x0008)
struct FKeyGuideListParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct AT.KeyGuideItem
// 0x0020
struct FKeyGuideItem
{
	struct FName                                       Note;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct AT.BannedSkillParam
// 0x0020 (0x0028 - 0x0008)
struct FBannedSkillParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct AT.LandMarkVisibleParam
// 0x0028 (0x0030 - 0x0008)
struct FLandMarkVisibleParam : public FTableRowBase
{
	                                                   Type;                                                     // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x27];                                      // 0x0009(0x0027) MISSED OFFSET
};

// ScriptStruct AT.RandomItemRewardParam
// 0x0068 (0x0070 - 0x0008)
struct FRandomItemRewardParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0008(0x0068) MISSED OFFSET
};

// ScriptStruct AT.SimulationBattleParam
// 0x0040 (0x0048 - 0x0008)
struct FSimulationBattleParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0008(0x0040) MISSED OFFSET
};

// ScriptStruct AT.TrainingBattleParam
// 0x0040 (0x0048 - 0x0008)
struct FTrainingBattleParam : public FTableRowBase
{
	                                                   Character;                                                // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3F];                                      // 0x0009(0x003F) MISSED OFFSET
};

// ScriptStruct AT.TrainingRemodelingParam
// 0x0060 (0x0068 - 0x0008)
struct FTrainingRemodelingParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0008(0x0060) MISSED OFFSET
};

// ScriptStruct AT.TelopDataParam
// 0x0040 (0x0048 - 0x0008)
struct FTelopDataParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0008(0x0040) MISSED OFFSET
};

// ScriptStruct AT.BonfireDataParam
// 0x0068 (0x0070 - 0x0008)
struct FBonfireDataParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0008(0x0068) MISSED OFFSET
};

// ScriptStruct AT.TrainingDataParam
// 0x0028 (0x0030 - 0x0008)
struct FTrainingDataParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) MISSED OFFSET
};

// ScriptStruct AT.TrainingConditionDataParam
// 0x0028
struct FTrainingConditionDataParam
{
	                                                   Type;                                                     // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x27];                                      // 0x0001(0x0027) MISSED OFFSET
};

// ScriptStruct AT.TrainingEventBattleExtendedParam
// 0x0010 (0x0018 - 0x0008)
struct FTrainingEventBattleExtendedParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct AT.CharacterDetailParam
// 0x0050 (0x0058 - 0x0008)
struct FCharacterDetailParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0008(0x0050) MISSED OFFSET
};

// ScriptStruct AT.WishLotteryParam
// 0x0018 (0x0020 - 0x0008)
struct FWishLotteryParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct AT.WishLotteryGroupParam
// 0x0030 (0x0038 - 0x0008)
struct FWishLotteryGroupParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.WishLotteryCountParam
// 0x0030 (0x0038 - 0x0008)
struct FWishLotteryCountParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.WishAddParam
// 0x0038 (0x0040 - 0x0008)
struct FWishAddParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0008(0x0038) MISSED OFFSET
};

// ScriptStruct AT.AddZOrbCount
// 0x0008
struct FAddZOrbCount
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct AT.WishCountParam
// 0x0028 (0x0030 - 0x0008)
struct FWishCountParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) MISSED OFFSET
};

// ScriptStruct AT.WishInfoParam
// 0x0078 (0x0080 - 0x0008)
struct FWishInfoParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x78];                                      // 0x0008(0x0078) MISSED OFFSET
};

// ScriptStruct AT.ShopInfoParam
// 0x0030 (0x0038 - 0x0008)
struct FShopInfoParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.CaptureFacialTypeParam
// 0x0008 (0x0010 - 0x0008)
struct FCaptureFacialTypeParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.CaptureModelParam
// 0x0058 (0x0060 - 0x0008)
struct FCaptureModelParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0008(0x0058) MISSED OFFSET
};

// ScriptStruct AT.MinigameBaseballRewardParam
// 0x0028 (0x0030 - 0x0008)
struct FMinigameBaseballRewardParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) MISSED OFFSET
};

// ScriptStruct AT.MinigameBaseballLocalRankingParam
// 0x0020 (0x0028 - 0x0008)
struct FMinigameBaseballLocalRankingParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct AT.MinigameBaseballDifficultyParam
// 0x0020 (0x0028 - 0x0008)
struct FMinigameBaseballDifficultyParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct AT.MinigameRaceLocalRankingParam
// 0x0040 (0x0048 - 0x0008)
struct FMinigameRaceLocalRankingParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0008(0x0040) MISSED OFFSET
};

// ScriptStruct AT.MinigameRaceRewardsParam
// 0x0038 (0x0040 - 0x0008)
struct FMinigameRaceRewardsParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0008(0x0038) MISSED OFFSET
};

// ScriptStruct AT.MinigameRaceCourseParam
// 0x0030 (0x0038 - 0x0008)
struct FMinigameRaceCourseParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.DisplayParam
// 0x0008 (0x0010 - 0x0008)
struct FDisplayParam : public FTableRowBase
{
	int                                                Width;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Height;                                                   // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AT.OptionParam
// 0x0060 (0x0068 - 0x0008)
struct FOptionParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0008(0x0060) MISSED OFFSET
};

// ScriptStruct AT.EnemyHpGaugeOneBar
// 0x0010 (0x0018 - 0x0008)
struct FEnemyHpGaugeOneBar : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct AT.BattleTipsTutorialParam
// 0x0010 (0x0018 - 0x0008)
struct FBattleTipsTutorialParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct AT.KeyTipsParam
// 0x0020 (0x0028 - 0x0008)
struct FKeyTipsParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct AT.TipsParam
// 0x0038 (0x0040 - 0x0008)
struct FTipsParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0008(0x0038) MISSED OFFSET
};

// ScriptStruct AT.UiMapParam
// 0x00A0 (0x00A8 - 0x0008)
struct FUiMapParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0008(0x00A0) MISSED OFFSET
};

// ScriptStruct AT.BattlePowerTextData
// 0x0028
struct FBattlePowerTextData
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.WalkingMobTalk
// 0x0018 (0x0020 - 0x0008)
struct FWalkingMobTalk : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupBannedSkillList
// 0x0018
struct FGameWindowSetupBannedSkillList
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupBuffInfo
// 0x0020
struct FGameWindowSetupBuffInfo
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupLinkList
// 0x0058
struct FGameWindowSetupLinkList
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0000(0x0058) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupWishInfo
// 0x0030
struct FGameWindowSetupWishInfo
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupComuEmbInfo
// 0x0008
struct FGameWindowSetupComuEmbInfo
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupTextMenuInfo
// 0x0010
struct FGameWindowSetupTextMenuInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupCheckInfo
// 0x0038
struct FGameWindowSetupCheckInfo
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupSelectItemInfo
// 0x0030
struct FGameWindowSetupSelectItemInfo
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.GameWindowSetupItemInfo
// 0x0020
struct FGameWindowSetupItemInfo
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.MessageItem
// 0x0058 (0x0060 - 0x0008)
struct FMessageItem : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0008(0x0058) MISSED OFFSET
};

// ScriptStruct AT.Anim2DParam_F
// 0x0008 (0x0010 - 0x0008)
struct FAnim2DParam_F : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.EnemyGageParam
// 0x0018 (0x0020 - 0x0008)
struct FEnemyGageParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct AT.MessageInfoTbl
// 0x01A0 (0x01A8 - 0x0008)
struct FMessageInfoTbl : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x1A0];                                     // 0x0008(0x01A0) MISSED OFFSET
};

// ScriptStruct AT.TargetInfo
// 0x0038
struct FTargetInfo
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.DamageInfo
// 0x0054
struct FDamageInfo
{
	unsigned char                                      UnknownData00[0x54];                                      // 0x0000(0x0054) MISSED OFFSET
};

// ScriptStruct AT.MultiEncounterEnemyInfo
// 0x0010
struct FMultiEncounterEnemyInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.EncounterEnemyInfo
// 0x0030
struct FEncounterEnemyInfo
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.EncounterInfo
// 0x0038
struct FEncounterInfo
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.EncounterDBInfo
// 0x0010
struct FEncounterDBInfo
{
	TArray<struct FEncounterInfo>                      EncounterDBInfo;                                          // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AT.MultiBattleDirectionInfo
// 0x0010
struct FMultiBattleDirectionInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.BattleDirectionInfo
// 0x0024
struct FBattleDirectionInfo
{
	unsigned char                                      UnknownData00[0x24];                                      // 0x0000(0x0024) MISSED OFFSET
};

// ScriptStruct AT.MiniMapInfo
// 0x0060
struct FMiniMapInfo
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0000(0x0060) MISSED OFFSET
};

// ScriptStruct AT.SkillChainComboHudInfo
// 0x0020
struct FSkillChainComboHudInfo
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.EnemyInfo
// 0x0450
struct FEnemyInfo
{
	unsigned char                                      UnknownData00[0x450];                                     // 0x0000(0x0450) MISSED OFFSET
};

// ScriptStruct AT.EnemyHudInfo
// 0x006C
struct FEnemyHudInfo
{
	unsigned char                                      UnknownData00[0x6C];                                      // 0x0000(0x006C) MISSED OFFSET
};

// ScriptStruct AT.Condition
// 0x001C
struct FCondition
{
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0000(0x001C) MISSED OFFSET
};

// ScriptStruct AT.Condition_E
// 0x0008
struct FCondition_E
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct AT.PlayerInfo
// 0x0038
struct FPlayerInfo
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.DBHaveCharInfo
// 0x0010
struct FDBHaveCharInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.SkillTreeImpLogInfo
// 0x0018
struct FSkillTreeImpLogInfo
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.LevelUpLogItem
// 0x0010
struct FLevelUpLogItem
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.InfoLogInfo
// 0x0020
struct FInfoLogInfo
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.InfoLog02Info
// 0x0018
struct FInfoLog02Info
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.InfoLogBar02InfoDesc
// 0x0018
struct FInfoLogBar02InfoDesc
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.InfoZOrbLogInfo
// 0x0008
struct FInfoZOrbLogInfo
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct AT.AT_UICursorParam
// 0x0010
struct FAT_UICursorParam
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.MapMIconLegend
// 0x0018
struct FMapMIconLegend
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.IconBlinker
// 0x0020
struct FIconBlinker
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.BlinkIconData
// 0x0010
struct FBlinkIconData
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.WorldMapIconData
// 0x0010
struct FWorldMapIconData
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.WorldMapsSymbol
// 0x0020
struct FWorldMapsSymbol
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.CmnMenuBar03Param
// 0x0060
struct FCmnMenuBar03Param
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0000(0x0060) MISSED OFFSET
};

// ScriptStruct AT.CmnWishMenuList00Param
// 0x0020
struct FCmnWishMenuList00Param
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.CmnSkillMenuList00Param
// 0x0030
struct FCmnSkillMenuList00Param
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.CmnMenuList00Param
// 0x0028
struct FCmnMenuList00Param
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.CmnMenuListParam
// 0x0068
struct FCmnMenuListParam
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0000(0x0068) MISSED OFFSET
};

// ScriptStruct AT.CmnMenuList03Param
// 0x0020
struct FCmnMenuList03Param
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.CmnQuestMenuList06Param
// 0x0048
struct FCmnQuestMenuList06Param
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0000(0x0048) MISSED OFFSET
};

// ScriptStruct AT.MenuWIndowSetupListNumMenuInfo
// 0x0018
struct FMenuWIndowSetupListNumMenuInfo
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.MenuData
// 0x0018
struct FMenuData
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.UIQuestInfo
// 0x0080
struct FUIQuestInfo
{
	unsigned char                                      UnknownData00[0x80];                                      // 0x0000(0x0080) MISSED OFFSET
};

// ScriptStruct AT.UIQuestDetail
// 0x0018
struct FUIQuestDetail
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.UIShopCustomColorParam
// 0x0030
struct FUIShopCustomColorParam
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.GaugeUpdateSpeedThresholdParam
// 0x0008
struct FGaugeUpdateSpeedThresholdParam
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct AT.CaptureSkillDetail
// 0x0048
struct FCaptureSkillDetail
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0000(0x0048) MISSED OFFSET
};

// ScriptStruct AT.TrainingDetailTask
// 0x0070
struct FTrainingDetailTask
{
	unsigned char                                      UnknownData00[0x70];                                      // 0x0000(0x0070) MISSED OFFSET
};

// ScriptStruct AT.TrainingDetailTaskData
// 0x0070
struct FTrainingDetailTaskData
{
	unsigned char                                      UnknownData00[0x70];                                      // 0x0000(0x0070) MISSED OFFSET
};

// ScriptStruct AT.UISkillTreeLayoutIdTbl
// 0x0008 (0x0010 - 0x0008)
struct FUISkillTreeLayoutIdTbl : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct AT.UISkillTreeLayout
// 0x0078 (0x0080 - 0x0008)
struct FUISkillTreeLayout : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x78];                                      // 0x0008(0x0078) MISSED OFFSET
};

// ScriptStruct AT.CaptureParam
// 0x0050
struct FCaptureParam
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct AT.BarData
// 0x0028
struct FBarData
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.StartpartyPartySelectData
// 0x00B0
struct FStartpartyPartySelectData
{
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0000(0x00B0) MISSED OFFSET
};

// ScriptStruct AT.StartStatusBasicParam
// 0x00C0
struct FStartStatusBasicParam
{
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0000(0x00C0) MISSED OFFSET
};

// ScriptStruct AT.SaveLoadBarParam
// 0x0080
struct FSaveLoadBarParam
{
	unsigned char                                      UnknownData00[0x80];                                      // 0x0000(0x0080) MISSED OFFSET
};

// ScriptStruct AT.StartStatusParam
// 0x00B0
struct FStartStatusParam
{
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0000(0x00B0) MISSED OFFSET
};

// ScriptStruct AT.StateIconInfo
// 0x0010
struct FStateIconInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.CharacterIconCodeList
// 0x0020 (0x0028 - 0x0008)
struct FCharacterIconCodeList : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct AT.CharacterResourceInfo
// 0x0020
struct FCharacterResourceInfo
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.CharacterIconInfo
// 0x0030 (0x0038 - 0x0008)
struct FCharacterIconInfo : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0008(0x0030) MISSED OFFSET
};

// ScriptStruct AT.ScrollText
// 0x00A0
struct FScrollText
{
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0000(0x00A0) MISSED OFFSET
};

// ScriptStruct AT.TextStyle
// 0x001C
struct FTextStyle
{
	struct FLinearColor                                Color;                                                    // 0x0000(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0010(0x000C) MISSED OFFSET
};

// ScriptStruct AT.CreditDetail
// 0x0020
struct FCreditDetail
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct AT.UIXcmnPlatBtnInfo
// 0x0038
struct FUIXcmnPlatBtnInfo
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct AT.UIXcmnPlatBtnTypeInfo
// 0x0030
struct FUIXcmnPlatBtnTypeInfo
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.XlistBar04Info
// 0x0058
struct FXlistBar04Info
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0000(0x0058) MISSED OFFSET
};

// ScriptStruct AT.UIXlistCustom00Param
// 0x0030
struct FUIXlistCustom00Param
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct AT.XlistList05Lay7Param
// 0x0028
struct FXlistList05Lay7Param
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct AT.ZCWNavigation
// 0x0048
struct FZCWNavigation
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0000(0x0048) MISSED OFFSET
};

// ScriptStruct AT.AT_ViewActorPlayerMoveParam
// 0x0048 (0x0050 - 0x0008)
struct FAT_ViewActorPlayerMoveParam : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0008(0x0048) MISSED OFFSET
};

// ScriptStruct AT.ActChargeHeatCutInfo
// 0x0010
struct FActChargeHeatCutInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct AT.Cpl002MakoudanShotParam
// 0x0018
struct FCpl002MakoudanShotParam
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct AT.Cpl002MakoudanDirectionParam
// 0x0008
struct FCpl002MakoudanDirectionParam
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct AT.Cpl005DeathSlicerAroundProjectile
// 0x000C
struct FCpl005DeathSlicerAroundProjectile
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0004(0x0008) MISSED OFFSET
};

// ScriptStruct AT.Cpl005LongRangeAProjectileParam
// 0x0024
struct FCpl005LongRangeAProjectileParam
{
	unsigned char                                      UnknownData00[0x24];                                      // 0x0000(0x0024) MISSED OFFSET
};

// ScriptStruct AT.DoubleSundayBeamOrbitInfo
// 0x0020
struct FDoubleSundayBeamOrbitInfo
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

