#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class ATExt.ATAnimationBlueprintChanger
// 0x0040 (FullSize[0x0140] - InheritedSize[0x0100])
class UATAnimationBlueprintChanger : public UActorComponent
{
public:
	TArray<struct FATABPChangerRequest>                RequestList;                                               // 0x0100(0x0010) (ZeroConstructor, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_B916[0x30];                                    // 0x0110(0x0030) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimationBlueprintChanger");
		return ptr;
	}



};

// Class ATExt.ATAnimNotify_CtrlBrightness
// 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
class UATAnimNotify_CtrlBrightness : public UAnimNotify
{
public:
	class UCurveFloat*                                 InAnimCurve;                                               // 0x0038(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                                 OutAnimCurve;                                              // 0x0040(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotify_CtrlBrightness");
		return ptr;
	}



};

// Class ATExt.ATAnimNotify_WearEffectSpawn
// 0x0030 (FullSize[0x0068] - InheritedSize[0x0038])
class UATAnimNotify_WearEffectSpawn : public UAnimNotify
{
public:
	class UParticleSystem*                             Effect;                                                    // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       AttachName;                                                // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     offsetLocation;                                            // 0x0048(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                                    OffsetRotation;                                            // 0x0054(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	TEnumAsByte<Engine_EAttachLocation>                AttachType;                                                // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_29FO[0x7];                                     // 0x0061(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotify_WearEffectSpawn");
		return ptr;
	}



};

// Class ATExt.ATAnimNotifyState_LoopWearEffectSpawn
// 0x0088 (FullSize[0x00B8] - InheritedSize[0x0030])
class UATAnimNotifyState_LoopWearEffectSpawn : public UAnimNotifyState
{
public:
	class UParticleSystem*                             Effect;                                                    // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               RotationFix;                                               // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_PUMW[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       AttachName;                                                // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     offsetLocation;                                            // 0x0048(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                                    OffsetRotation;                                            // 0x0054(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	TEnumAsByte<Engine_EAttachLocation>                AttachType;                                                // 0x0060(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_1OXA[0x7];                                     // 0x0061(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<uint32_t, struct FLoopWearEffectInfo>         ParticleMap;                                               // 0x0068(0x0050) (BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotifyState_LoopWearEffectSpawn");
		return ptr;
	}



};

// Class ATExt.ATAnimNotifyState_WearEffect
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class UATAnimNotifyState_WearEffect : public UAnimNotifyState
{
public:
	bool                                               UseHeatUp;                                                 // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               NotEndHeatUp;                                              // 0x0031(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_UL7L[0x6];                                     // 0x0032(0x0006) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotifyState_WearEffect");
		return ptr;
	}



};

// Class ATExt.ATEventBattlePhaseBase
// 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
class UATEventBattlePhaseBase : public UObject
{
public:
	unsigned char                                      UnknownData_1HWU[0x8];                                     // 0x0028(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATEventBattlePhaseBase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0101MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0101MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_G2I5[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0101MainPhase");
		return ptr;
	}



};

// Class ATExt.ATEventBattleRootManagerBase
// 0x0058 (FullSize[0x0390] - InheritedSize[0x0338])
class AATEventBattleRootManagerBase : public AActor
{
public:
	TArray<class UClass*>                              PhaseClass;                                                // 0x0338(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UATEventBattlePhaseBase*>             PhaseTbl;                                                  // 0x0348(0x0010) (ZeroConstructor, NativeAccessSpecifierPrivate)
	class UATEventBattleSituationJudge*                StuationJudge;                                             // 0x0358(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UATEventBattleCondition*                     BattleCondition;                                           // 0x0360(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UATEventBattleAfterAction*                   AfterAction;                                               // 0x0368(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClass*                                      RoofBarrierClass;                                          // 0x0370(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              RoofBarrierOffset;                                         // 0x0378(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_EJQO[0x4];                                     // 0x037C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AActor*                                      RoofBarrierActor;                                          // 0x0380(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_KFFL[0x8];                                     // 0x0388(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATEventBattleRootManagerBase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0101RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0101RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              MarginValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_KV03[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0101RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0102MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle0102MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_KTRY[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0102MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0102RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0102RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              MarginValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              HeatupValue;                                               // 0x0394(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0102RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0201MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0201MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_OHCU[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0201MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0201RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle0201RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0201RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0301MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle0301MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_ZBUF[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0301MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0301RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0301RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              MarginValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              HeatupValue;                                               // 0x0394(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0301RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0302MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0302MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_XIPU[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0302MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0302RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0302RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              MarginValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_BS30[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0302RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0401MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle0401MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_TDR7[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0401MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0401RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0401RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_5BAL[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0401RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0402MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0402MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_Z616[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0402MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0402RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle0402RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0402RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0501MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle0501MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_G6Z3[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0501MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0501RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0501RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_ZVWI[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0501RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0502MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0502MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_AVGC[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0502MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0502RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle0502RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0502RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0601MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0601MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_D6XM[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0601MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0601RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle0601RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0601RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0602MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0602MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_MJT1[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0602MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0602RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle0602RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0602RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0701MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0701MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_9TYX[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0701MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0701RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0701RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              MarginValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_BIP0[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0701RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0702MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0702MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_QSNF[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0702MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0702RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle0702RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0702RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0801MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle0801MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_39A1[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0801MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0801RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0801RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_BQ98[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0801RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0802MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle0802MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_OX9Q[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0802MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0802RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0802RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_NAOE[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0802RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0901MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle0901MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_5D3G[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0901MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0901RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle0901RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0901RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0902MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle0902MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_GQVV[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0902MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle0902RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle0902RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              MarginValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              HeatupValue;                                               // 0x0394(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0902RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1001MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle1001MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_I1ZC[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1001MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1001RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle1001RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_CBYU[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1001RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1101MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle1101MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_ZZJN[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1101MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1101RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle1101RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1101RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1102MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle1102MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_G45C[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1102MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1102RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle1102RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1102RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1201MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle1201MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_IH2Q[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1201MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1201RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle1201RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1201RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1202MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle1202MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_4HP6[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1202MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1202RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle1202RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_LMB3[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1202RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1301MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle1301MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_PJQG[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1301MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1301RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle1301RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1301RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1302MainPhase
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UATBossBattle1302MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_Z4SG[0x58];                                    // 0x0030(0x0058) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1302MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1302RootManager
// 0x0000 (FullSize[0x0390] - InheritedSize[0x0390])
class AATBossBattle1302RootManager : public AATEventBattleRootManagerBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1302RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1401MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle1401MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_I4FN[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1401MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1401RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle1401RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_10F2[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1401RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1501MainPhase
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UATBossBattle1501MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_OYNO[0x60];                                    // 0x0030(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1501MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1501RootManager
// 0x0008 (FullSize[0x0398] - InheritedSize[0x0390])
class AATBossBattle1501RootManager : public AATEventBattleRootManagerBase
{
public:
	float                                              HeatupValue;                                               // 0x0390(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_YVNZ[0x4];                                     // 0x0394(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1501RootManager");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1502MainPhase
// 0x0068 (FullSize[0x0098] - InheritedSize[0x0030])
class UATBossBattle1502MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData_0GXJ[0x68];                                    // 0x0030(0x0068) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1502MainPhase");
		return ptr;
	}



};

// Class ATExt.ATBossBattle1502RootManager
// 0x0048 (FullSize[0x03D8] - InheritedSize[0x0390])
class AATBossBattle1502RootManager : public AATEventBattleRootManagerBase
{
public:
	class UParticleSystem*                             ParticleGenkiBall;                                         // 0x0390(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystem*                             ParticleGenkiParticle;                                     // 0x0398(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClass*                                      GenkiBallCollisionClass;                                   // 0x03A0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     GenkiBallLocation;                                         // 0x03A8(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     GenkiParticleLocation;                                     // 0x03B4(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystemComponent*                    ParticleCompGenkiBall;                                     // 0x03C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystemComponent*                    ParticleCompGenkiParticle;                                 // 0x03C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                      GenkiBallCollision;                                        // 0x03D0(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1502RootManager");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl001
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl001 : public AAT_CharacterPlayableBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl001");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl001N
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl001N : public AATCharacterCpl001
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl001N");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl002Base
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl002Base : public AAT_CharacterPlayableBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002Base");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl002A
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl002A : public AATCharacterCpl002Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002A");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl002B
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl002B : public AATCharacterCpl002Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002B");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl002C
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl002C : public AATCharacterCpl002Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002C");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl002D
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl002D : public AATCharacterCpl002Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002D");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl002Z
// 0x0000 (FullSize[0x0FB0] - InheritedSize[0x0FB0])
class AATCharacterCpl002Z : public AAT_CharacterHugeBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002Z");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl003Base
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl003Base : public AAT_CharacterPlayableBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003Base");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl003A
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl003A : public AATCharacterCpl003Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003A");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl003B
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl003B : public AATCharacterCpl003Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003B");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl003Z
// 0x0000 (FullSize[0x0FB0] - InheritedSize[0x0FB0])
class AATCharacterCpl003Z : public AAT_CharacterHugeBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003Z");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl004Base
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl004Base : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004Base");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl004c01
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl004c01 : public AATCharacterCpl004Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c01");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl004c02
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl004c02 : public AATCharacterCpl004Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c02");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl004c03
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl004c03 : public AATCharacterCpl004Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c03");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl004c04
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl004c04 : public AATCharacterCpl004Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c04");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl005Base
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl005Base : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005Base");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl005A
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl005A : public AATCharacterCpl005Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005A");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl005B
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl005B : public AATCharacterCpl005Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005B");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl005C
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl005C : public AATCharacterCpl005Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005C");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl005D
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl005D : public AATCharacterCpl005Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005D");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl005E
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl005E : public AATCharacterCpl005Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005E");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl006
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl006 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl006");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl007
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl007 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl007");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl008
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl008 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl008");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl009
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl009 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl009");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl010
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl010 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl010");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl011
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl011 : public AAT_CharacterPlayableBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl011");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl012
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl012 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl012");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl013
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl013 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl013");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl014Base
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl014Base : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014Base");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl014c01
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl014c01 : public AATCharacterCpl014Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c01");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl014c02
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl014c02 : public AATCharacterCpl014Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c02");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl014c03
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl014c03 : public AATCharacterCpl014Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c03");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl014c04
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl014c04 : public AATCharacterCpl014Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c04");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl014c05
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl014c05 : public AATCharacterCpl014Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c05");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl017
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl017 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl017");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl018
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl018 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl018");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl019Base
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl019Base : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl019Base");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl019A
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl019A : public AATCharacterCpl019Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl019A");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl019B
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl019B : public AATCharacterCpl019Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl019B");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl020
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl020 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl020");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl021
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl021 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl021");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl022
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl022 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl022");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl023
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl023 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl023");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl024
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl024 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl024");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl025
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl025 : public AAT_Character
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl025");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl028Base
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl028Base : public AAT_CharacterPlayableBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl028Base");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl028A
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl028A : public AATCharacterCpl028Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl028A");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl028B
// 0x0000 (FullSize[0x0FA0] - InheritedSize[0x0FA0])
class AATCharacterCpl028B : public AATCharacterCpl028Base
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl028B");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl029
// 0x0020 (FullSize[0x0FC0] - InheritedSize[0x0FA0])
class AATCharacterCpl029 : public AAT_Character
{
public:
	class UParticleSystem*                             AbsorbEffect;                                              // 0x0FA0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     AbsorbEffectLocation;                                      // 0x0FA8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AbsorbLifeRate;                                            // 0x0FB4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_04I8[0x8];                                     // 0x0FB8(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl029");
		return ptr;
	}



};

// Class ATExt.ATCharacterCpl030
// 0x0130 (FullSize[0x10D0] - InheritedSize[0x0FA0])
class AATCharacterCpl030 : public AAT_Character
{
public:
	class UParticleSystem*                             ParticleAbsorbST_1;                                        // 0x0FA0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                             ParticleAbsorbLP_1;                                        // 0x0FA8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                             ParticleAbsorbST_2;                                        // 0x0FB0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                             ParticleAbsorbLP_2;                                        // 0x0FB8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                             ParticleAbsorbExec;                                        // 0x0FC0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*                    ParticleCompCameraAttachHitEffect;                         // 0x0FC8(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     BG_Color_IN;                                               // 0x0FD0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     BG_Color_OUT;                                              // 0x0FDC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Main_Color_IN;                                             // 0x0FE8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Main_Color_OUT;                                            // 0x0FF4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Ring_Color_IN;                                             // 0x1000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Ring_Color_OUT;                                            // 0x100C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Aura_Color_IN;                                             // 0x1018(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Aura_Color_OUT;                                            // 0x1024(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Aura_Alfa_IN;                                              // 0x1030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Aura_Alfa_OUT;                                             // 0x1034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AbsorbModeTime;                                            // 0x1038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
