#pragma once

// Name: DBZKakarot, Version: 1.0.3

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class ATExt.ATAnimationBlueprintChanger
// 0x0040 (0x0140 - 0x0100)
class UATAnimationBlueprintChanger : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0100(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimationBlueprintChanger");
		return ptr;
	}

};


// Class ATExt.ATAnimNotify_CtrlBrightness
// 0x0010 (0x0048 - 0x0038)
class UATAnimNotify_CtrlBrightness : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotify_CtrlBrightness");
		return ptr;
	}

};


// Class ATExt.ATAnimNotify_WearEffectSpawn
// 0x0030 (0x0068 - 0x0038)
class UATAnimNotify_WearEffectSpawn : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0038(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotify_WearEffectSpawn");
		return ptr;
	}

};


// Class ATExt.ATAnimNotifyState_LoopWearEffectSpawn
// 0x0088 (0x00B8 - 0x0030)
class UATAnimNotifyState_LoopWearEffectSpawn : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0030(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotifyState_LoopWearEffectSpawn");
		return ptr;
	}

};


// Class ATExt.ATAnimNotifyState_WearEffect
// 0x0008 (0x0038 - 0x0030)
class UATAnimNotifyState_WearEffect : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATAnimNotifyState_WearEffect");
		return ptr;
	}

};


// Class ATExt.ATEventBattlePhaseBase
// 0x0008 (0x0030 - 0x0028)
class UATEventBattlePhaseBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATEventBattlePhaseBase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0101MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0101MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0101MainPhase");
		return ptr;
	}

};


// Class ATExt.ATEventBattleRootManagerBase
// 0x0058 (0x0390 - 0x0338)
class AATEventBattleRootManagerBase : public AActor
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0338(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATEventBattleRootManagerBase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0101RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0101RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0101RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0102MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle0102MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0102MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0102RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0102RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0102RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0201MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0201MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0201MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0201RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle0201RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0201RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0301MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle0301MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0301MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0301RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0301RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0301RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0302MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0302MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0302MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0302RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0302RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0302RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0401MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle0401MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0401MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0401RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0401RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0401RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0402MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0402MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0402MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0402RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle0402RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0402RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0501MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle0501MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0501MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0501RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0501RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0501RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0502MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0502MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0502MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0502RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle0502RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0502RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0601MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0601MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0601MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0601RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle0601RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0601RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0602MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0602MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0602MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0602RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle0602RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0602RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0701MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0701MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0701MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0701RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0701RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0701RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0702MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0702MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0702MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0702RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle0702RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0702RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0801MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle0801MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0801MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0801RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0801RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0801RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0802MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle0802MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0802MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0802RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0802RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0802RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0901MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle0901MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0901MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0901RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle0901RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0901RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0902MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle0902MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0902MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle0902RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle0902RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle0902RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1001MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle1001MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1001MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1001RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle1001RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1001RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1101MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle1101MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1101MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1101RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle1101RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1101RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1102MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle1102MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1102MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1102RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle1102RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1102RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1201MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle1201MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1201MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1201RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle1201RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1201RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1202MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle1202MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1202MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1202RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle1202RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1202RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1301MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle1301MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1301MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1301RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle1301RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1301RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1302MainPhase
// 0x0058 (0x0088 - 0x0030)
class UATBossBattle1302MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1302MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1302RootManager
// 0x0000 (0x0390 - 0x0390)
class AATBossBattle1302RootManager : public AATEventBattleRootManagerBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1302RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1401MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle1401MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1401MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1401RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle1401RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1401RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1501MainPhase
// 0x0060 (0x0090 - 0x0030)
class UATBossBattle1501MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0030(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1501MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1501RootManager
// 0x0008 (0x0398 - 0x0390)
class AATBossBattle1501RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1501RootManager");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1502MainPhase
// 0x0068 (0x0098 - 0x0030)
class UATBossBattle1502MainPhase : public UATEventBattlePhaseBase
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0030(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1502MainPhase");
		return ptr;
	}

};


// Class ATExt.ATBossBattle1502RootManager
// 0x0048 (0x03D8 - 0x0390)
class AATBossBattle1502RootManager : public AATEventBattleRootManagerBase
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0390(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATBossBattle1502RootManager");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl001
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl001 : public AAT_CharacterPlayableBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl001");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl001N
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl001N : public AATCharacterCpl001
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl001N");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl002Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl002Base : public AAT_CharacterPlayableBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl002A
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl002A : public AATCharacterCpl002Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002A");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl002B
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl002B : public AATCharacterCpl002Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002B");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl002C
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl002C : public AATCharacterCpl002Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002C");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl002D
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl002D : public AATCharacterCpl002Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002D");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl002Z
// 0x0000 (0x0FB0 - 0x0FB0)
class AATCharacterCpl002Z : public AAT_CharacterHugeBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl002Z");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl003Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl003Base : public AAT_CharacterPlayableBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl003A
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl003A : public AATCharacterCpl003Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003A");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl003B
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl003B : public AATCharacterCpl003Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003B");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl003Z
// 0x0000 (0x0FB0 - 0x0FB0)
class AATCharacterCpl003Z : public AAT_CharacterHugeBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl003Z");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl004Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl004Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl004c01
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl004c01 : public AATCharacterCpl004Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl004c02
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl004c02 : public AATCharacterCpl004Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl004c03
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl004c03 : public AATCharacterCpl004Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl004c04
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl004c04 : public AATCharacterCpl004Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl004c04");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl005Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl005Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl005A
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl005A : public AATCharacterCpl005Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005A");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl005B
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl005B : public AATCharacterCpl005Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005B");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl005C
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl005C : public AATCharacterCpl005Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005C");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl005D
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl005D : public AATCharacterCpl005Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005D");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl005E
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl005E : public AATCharacterCpl005Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl005E");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl006
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl006 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl006");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl007
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl007 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl007");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl008
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl008 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl008");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl009
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl009 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl009");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl010
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl010 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl010");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl011
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl011 : public AAT_CharacterPlayableBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl011");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl012
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl012 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl012");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl013
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl013 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl013");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl014Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl014Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl014c01
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl014c01 : public AATCharacterCpl014Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl014c02
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl014c02 : public AATCharacterCpl014Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl014c03
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl014c03 : public AATCharacterCpl014Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl014c04
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl014c04 : public AATCharacterCpl014Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c04");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl014c05
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl014c05 : public AATCharacterCpl014Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl014c05");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl017
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl017 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl017");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl018
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl018 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl018");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl019Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl019Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl019Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl019A
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl019A : public AATCharacterCpl019Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl019A");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl019B
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl019B : public AATCharacterCpl019Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl019B");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl020
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl020 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl020");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl021
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl021 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl021");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl022
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl022 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl022");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl023
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl023 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl023");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl024
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl024 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl024");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl025
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl025 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl025");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl028Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl028Base : public AAT_CharacterPlayableBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl028Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl028A
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl028A : public AATCharacterCpl028Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl028A");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl028B
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl028B : public AATCharacterCpl028Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl028B");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl029
// 0x0020 (0x0FC0 - 0x0FA0)
class AATCharacterCpl029 : public AAT_Character
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0FA0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl029");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl030
// 0x0130 (0x10D0 - 0x0FA0)
class AATCharacterCpl030 : public AAT_Character
{
public:
	unsigned char                                      UnknownData00[0x130];                                     // 0x0FA0(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl030");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl031
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl031 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl031");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl032
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl032 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl032");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl034Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl034Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl034Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl034A
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl034A : public AATCharacterCpl034Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl034A");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl034B
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl034B : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl034B");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl034C
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl034C : public AATCharacterCpl034Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl034C");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl035
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl035 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl035");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl036
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl036 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl036");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl038
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl038 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl038");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl039
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl039 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl039");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl040
// 0x0070 (0x1010 - 0x0FA0)
class AATCharacterCpl040 : public AAT_Character
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0FA0(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl040");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl041Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl041Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl041Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl041A
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl041A : public AATCharacterCpl041Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl041A");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl041B
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl041B : public AATCharacterCpl041Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl041B");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl041C
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl041C : public AATCharacterCpl041Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl041C");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl041E
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl041E : public AATCharacterCpl041Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl041E");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl042
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl042 : public AAT_CharacterPlayableBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl042");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl043
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl043 : public AAT_CharacterPlayableBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl043");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl056Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl056Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl056Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl056c01
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl056c01 : public AATCharacterCpl056Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl056c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl056c02
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl056c02 : public AATCharacterCpl056Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl056c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl056c03
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl056c03 : public AATCharacterCpl056Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl056c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl057Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl057Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl057Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl057c01
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl057c01 : public AATCharacterCpl057Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl057c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl057c02
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl057c02 : public AATCharacterCpl057Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl057c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl057c03
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl057c03 : public AATCharacterCpl057Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl057c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl058Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl058Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl058Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl058c01
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl058c01 : public AATCharacterCpl058Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl058c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl058c02
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl058c02 : public AATCharacterCpl058Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl058c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl058c03
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl058c03 : public AATCharacterCpl058Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl058c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl059Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl059Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl059Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl059c01
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl059c01 : public AATCharacterCpl059Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl059c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl059c02
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl059c02 : public AATCharacterCpl059Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl059c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl059c03
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl059c03 : public AATCharacterCpl059Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl059c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl060
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl060 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl060");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl061
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl061 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl061");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl062
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl062 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl062");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl063
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl063 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl063");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl064Base
// 0x0010 (0x0FB0 - 0x0FA0)
class AATCharacterCpl064Base : public AAT_Character
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0FA0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl064Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl064c01
// 0x0000 (0x0FB0 - 0x0FB0)
class AATCharacterCpl064c01 : public AATCharacterCpl064Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl064c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl064c02
// 0x0000 (0x0FB0 - 0x0FB0)
class AATCharacterCpl064c02 : public AATCharacterCpl064Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl064c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl064c03
// 0x0000 (0x0FB0 - 0x0FB0)
class AATCharacterCpl064c03 : public AATCharacterCpl064Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl064c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl065Base
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl065Base : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl065Base");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl065c01
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl065c01 : public AATCharacterCpl065Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl065c01");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl065c02
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl065c02 : public AATCharacterCpl065Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl065c02");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl065c03
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl065c03 : public AATCharacterCpl065Base
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl065c03");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl067
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl067 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl067");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl069
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl069 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl069");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl070
// 0x0000 (0x0FA0 - 0x0FA0)
class AATCharacterCpl070 : public AAT_Character
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl070");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl071
// 0x0040 (0x0FE0 - 0x0FA0)
class AATCharacterCpl071 : public AAT_Character
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0FA0(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl071");
		return ptr;
	}

};


// Class ATExt.ATCharacterCpl074
// 0x0060 (0x1000 - 0x0FA0)
class AATCharacterCpl074 : public AAT_Character
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0FA0(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCharacterCpl074");
		return ptr;
	}

};


// Class ATExt.ATCommunityBoard
// 0x0110 (0x0138 - 0x0028)
class UATCommunityBoard : public UObject
{
public:
	unsigned char                                      UnknownData00[0x110];                                     // 0x0028(0x0110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunityBoard");
		return ptr;
	}

};


// Class ATExt.ATCommunityManager
// 0x0158 (0x0258 - 0x0100)
class UATCommunityManager : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x158];                                     // 0x0100(0x0158) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunityManager");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillBase
// 0x0038 (0x0060 - 0x0028)
class UATCommunitySkillBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0028(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillBase");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillZFighters
// 0x0008 (0x0068 - 0x0060)
class UATCommunitySkillZFighters : public UATCommunitySkillBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillZFighters");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillCooking
// 0x0010 (0x0070 - 0x0060)
class UATCommunitySkillCooking : public UATCommunitySkillBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0060(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillCooking");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillTraining
// 0x0008 (0x0068 - 0x0060)
class UATCommunitySkillTraining : public UATCommunitySkillBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillTraining");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillDevelop
// 0x0000 (0x0060 - 0x0060)
class UATCommunitySkillDevelop : public UATCommunitySkillBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillDevelop");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillGods
// 0x0008 (0x0068 - 0x0060)
class UATCommunitySkillGods : public UATCommunitySkillBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillGods");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillAdult
// 0x0010 (0x0070 - 0x0060)
class UATCommunitySkillAdult : public UATCommunitySkillBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0060(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillAdult");
		return ptr;
	}

};


// Class ATExt.ATCommunitySkillAdventure
// 0x0010 (0x0070 - 0x0060)
class UATCommunitySkillAdventure : public UATCommunitySkillBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0060(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATCommunitySkillAdventure");
		return ptr;
	}

};


// Class ATExt.ATDataAssetCarParameterArea
// 0x0018 (0x0048 - 0x0030)
class UATDataAssetCarParameterArea : public UATDataAssetBase
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATDataAssetCarParameterArea");
		return ptr;
	}

};


// Class ATExt.ATDataAssetTalkAnimAsyncLoad
// 0x0040 (0x0070 - 0x0030)
class UATDataAssetTalkAnimAsyncLoad : public UATDataAssetAsyncLoad
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET
	struct FLoadingTalkAnimAsset                       LoadingAsset;                                             // 0x0040(0x0028)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0068(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATDataAssetTalkAnimAsyncLoad");
		return ptr;
	}

};


// Class ATExt.ATTalkAnimLoader
// 0x0060 (0x0088 - 0x0028)
class UATTalkAnimLoader : public UObject
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0028(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATTalkAnimLoader");
		return ptr;
	}

};


// Class ATExt.ATDataAssetTalkAnimation
// 0x0010 (0x0040 - 0x0030)
class UATDataAssetTalkAnimation : public UATDataAssetBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATDataAssetTalkAnimation");
		return ptr;
	}

};


// Class ATExt.ATDebugDrawTime
// 0x0010 (0x0040 - 0x0030)
class UATDebugDrawTime : public UCFManagerObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATDebugDrawTime");
		return ptr;
	}

};


// Class ATExt.ATDebugMenuHandler
// 0x0008 (0x00F0 - 0x00E8)
class UATDebugMenuHandler : public UCFDebugMenuHandler
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00E8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATDebugMenuHandler");
		return ptr;
	}

};


// Class ATExt.ATDebugMenuEventHandler
// 0x0050 (0x0078 - 0x0028)
class UATDebugMenuEventHandler : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0028(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.ATDebugMenuEventHandler");
		return ptr;
	}

};


// Class ATExt.CFDMLogSwitchBattle
// 0x0000 (0x0058 - 0x0058)
class UCFDMLogSwitchBattle : public UCFDebugMenuEventHandlerBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ATExt.CFDMLogSwitchBattle");
		return ptr;
	}

};


// Class ATExt.CFDMLogSwitchProjectile
// 0x0000 (0x0058 - 0x0058)
