#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Deer_AnimBP.Deer_AnimBP_C
// 0x2074 (FullSize[0x2474] - InheritedSize[0x0400])
class UDeer_AnimBP_C : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0400(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_0E57529D47146AA459FC2588C63DAE4F;       // 0x0408(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0E5597044B6E0600E62B49C63E68FA3; // 0x0448(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4F3932B4AA434A0868CA68BEE3B29EA; // 0x0490(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7936DF1E40E7310592AF7792F1B1EB7A; // 0x04D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FEA1F634AE61C10756A9693DBCF1930; // 0x0520(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B7C0BBF9429651BA8B59DDAD3C60CAAB; // 0x0568(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BAEE24A341E8975F8357A78C83C6730C; // 0x05B0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_ACF09986445E24C1AD4024BEF1E6B574; // 0x0650(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4F8658DC451FE2DE60E07D8D1AEB838E; // 0x0690(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CB0431574602DBD7B849419AF474FBC9; // 0x0730(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_718ED3F54B8DF79D5D84DB91BF63A6AD; // 0x0770(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7DD7D8FD4EDED3473E95DF99ACC0427B; // 0x0810(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CFA870F7427364C991008CB7C06B62AD; // 0x0850(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5964695465759BE52B696B2B653EF24; // 0x0898(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C682EF04EF3C3FA76DF7CA15FDFE038; // 0x08E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F7EC5191487C497BC1A371AABA89DD2C; // 0x0928(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E895D512488B9F52491C7CB0C9C8CE33; // 0x0970(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF5FA3FD40CBEF8508A2528A7743E6B1; // 0x09B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_04748C824EAE73C68363BC8D880C8937; // 0x0A00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B588B68487CD84DE55CD0A02DB57DDB; // 0x0A48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16FE2756444D393345E166BE1C421392; // 0x0A90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C13494174F51A8800C6A9B8F623CF4AF; // 0x0AD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A805E42D4819870B84BB6B8C19ECF347; // 0x0B20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C46BF4C149B77CCD7948968EA76F7B80; // 0x0B68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_860CBC354DE1BBC25244EFB185244AB3; // 0x0BB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1310095F4392BAD20C424BB888F6C019; // 0x0BF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A03FE94341FC1B56FF3B138C2C3EF32B; // 0x0C40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C85DFA444BBD2AEB40BCA86DFE732B8; // 0x0C88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE82DC5245FEAF2F3B1FD3A17F8F4AC5; // 0x0CD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E058B44946A83C715B0316AC3DF3B370; // 0x0D18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_302A45214D0B22F1C450949F380B0E61; // 0x0D60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_358A59C44F89445ADF5DB2A8DE052CD6; // 0x0DA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE3E43D145E4D35789A4F2B0C2E58EC6; // 0x0DF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_07EB406A44E9680EFB08C9A0E8124E46; // 0x0E38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5CD66944EC0E180ABFA4F80F538EB5C; // 0x0E80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_417E886C4C5B26BC3429F48E95BF11F9; // 0x0EC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40BEE8944B5A1994E4D139A00034C403; // 0x0F10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F850307470E2EC7FE98B2B7D5D7F067; // 0x0F58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FBE02D524027D7D99B9456BE9CA2AE07; // 0x0FA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EB5A6B3470D5C2624C83BA8763DC3BD; // 0x0FE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A26068D4331C818CC6BE5A3C956092B; // 0x1030(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2E1845F4465B75F38C311DAA3BA880A8; // 0x10D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B677B83349782C7653D7B4BBB5237C38; // 0x1110(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9129568C404872DC868E7DB20FD27C4D; // 0x1158(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2025F02245078E070A0DB9A01EB9CDC3; // 0x11F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E985C25741B3CFA4EDD12292C41B3AEC; // 0x1238(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6C7A0E8D4E1676558DC21EA5F53B8E82; // 0x12D8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1ECF0D184C600434685FE78CC637B5C0; // 0x1318(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_552EB0BD48D67C205CA2EAAF81ACEC80; // 0x13B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA903E274FC8B0A3F4FBD39C502456BD; // 0x13F8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3CA9A35046CA5B4E01F5AD9E04D40227; // 0x1498(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_554785804BD59CFB784698B2FDFA8279; // 0x14D8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9A33911A4141697A68F97BBEB38497C2; // 0x1578(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AD34206F4B0D4C947CD4359C452CD0CB; // 0x15B8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A14482A64B185527DA1AA89709290A84; // 0x1658(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_009DE4BE43697673F2B44EB935B2C4DB; // 0x1698(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_138FB1D14FAF78FDB4E18297CF8AFDE9; // 0x1738(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_808CF1F448C32D55CB3E7E93E62D31F3; // 0x1778(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_799DCA234AC33A7C7A1BE08A077A42E3; // 0x1818(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC2EDAC84FC47F22AB304FA93104AD95; // 0x1858(0x00A0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_00EBDE8A4EDE039395CDBEABE00CC9F5; // 0x18F8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_96D39EF04BF450FD93D9F3B4FA28514D; // 0x19D8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6A1174264A92593247FC2FBEFB10ADDE; // 0x1A78(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1D703AEF47D7E672CFDC2DB81E9B068D; // 0x1AB8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_678714B7473C339F21824C8DA6D915E5; // 0x1B58(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EEFBF9814C1977B691991B8EEAA6F833; // 0x1B98(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_917EB2D94897EB49CDDDDAA3D786BDDA; // 0x1C78(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3E6D140742D5DF973A42ABA82F21EF0C; // 0x1CB8(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9B5F84814B720E0ED8A86184D384EBF3; // 0x1D98(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_13CD8BFB44B4DF9F95F7EC8650DBD22A; // 0x1DD8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_73F0E9FF40E9859F38CC119FB3DB819B; // 0x1F10(0x0138)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E5E489A94DC280064DE5FBAA216C187F; // 0x2048(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D0AF03234995577FA305FBAFF38DC76A; // 0x2088(0x0138)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CEB8DD4840484194C5A704AA739ABB64; // 0x21C0(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_748730EC41C225D97B84D79C4A2CB979;       // 0x2298(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B02EF31941A4D95D9AC4F0907C1727AC; // 0x2300(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B799432B470AC077CF0F49B412AB9860; // 0x23D8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D2E0BB7A405B52B499F4E1B1AA93BC12; // 0x2420(0x0048)
	struct FRotator                                    Neck01Rotation_1;                                          // 0x2468(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Deer_AnimBP.Deer_AnimBP_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_6B588B68487CD84DE55CD0A02DB57DDB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_16FE2756444D393345E166BE1C421392();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_C13494174F51A8800C6A9B8F623CF4AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_A805E42D4819870B84BB6B8C19ECF347();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_F7EC5191487C497BC1A371AABA89DD2C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_C46BF4C149B77CCD7948968EA76F7B80();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_860CBC354DE1BBC25244EFB185244AB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_1310095F4392BAD20C424BB888F6C019();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_A03FE94341FC1B56FF3B138C2C3EF32B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_8C682EF04EF3C3FA76DF7CA15FDFE038();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_5C85DFA444BBD2AEB40BCA86DFE732B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_EE82DC5245FEAF2F3B1FD3A17F8F4AC5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_E058B44946A83C715B0316AC3DF3B370();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_302A45214D0B22F1C450949F380B0E61();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_CFA870F7427364C991008CB7C06B62AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_358A59C44F89445ADF5DB2A8DE052CD6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_EE3E43D145E4D35789A4F2B0C2E58EC6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_07EB406A44E9680EFB08C9A0E8124E46();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_B5CD66944EC0E180ABFA4F80F538EB5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_417E886C4C5B26BC3429F48E95BF11F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_40BEE8944B5A1994E4D139A00034C403();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_0F850307470E2EC7FE98B2B7D5D7F067();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_B7C0BBF9429651BA8B59DDAD3C60CAAB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_FBE02D524027D7D99B9456BE9CA2AE07();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_8EB5A6B3470D5C2624C83BA8763DC3BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_B677B83349782C7653D7B4BBB5237C38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_4FEA1F634AE61C10756A9693DBCF1930();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_7936DF1E40E7310592AF7792F1B1EB7A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_F4F3932B4AA434A0868CA68BEE3B29EA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_F0E5597044B6E0600E62B49C63E68FA3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_E895D512488B9F52491C7CB0C9C8CE33();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_04748C824EAE73C68363BC8D880C8937();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Deer_AnimBP_AnimGraphNode_TransitionResult_AF5FA3FD40CBEF8508A2528A7743E6B1();
	void ExecuteUbergraph_Deer_AnimBP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
