#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Dinosaur_AnimBP.Dinosaur_AnimBP_C
// 0x2198 (FullSize[0x2598] - InheritedSize[0x0400])
class UDinosaur_AnimBP_C : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0400(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_ECB58E8D46F82769CBA6F09528B309CE;       // 0x0408(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3DFC75D847534F9F54BE85BD4B10B560; // 0x0448(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B31521B54C42ECB4EE525695419EC745; // 0x0490(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF385665495E0BFBCDD97A8F452A056B; // 0x04D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_296757084DF263AEB3BC55A33B234ECD; // 0x0520(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ECB7765A462C0697B5DC40914C09FB10; // 0x0568(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ED02C42047018BCD43A1938139C8A0D9; // 0x05B0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7EDC0C14461DB6309ACD1A9647DD132D; // 0x0650(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE92E1BA444CBB9B9708E0AAAFB3A2AA; // 0x0690(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87F143AE415395E1D25E65925284CB97; // 0x06D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0BAE200B4D0CCB7EB8AACAA5EC99E468; // 0x0720(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B2ABF2014A6222B5482F7C94B819BA3E; // 0x0768(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFC38A664A93B2E55B5FC194D66D463A; // 0x07B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CBCCF84744C6BEAD2BA568ABE337745C; // 0x07F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C83A9A94908DD75C474FE830A229DF8; // 0x0840(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7FE744BB4A33B0B255897FA0816B6F94; // 0x0888(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C418AE849214B9CEF1EF7872671A52B; // 0x08D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F62CC79C45819CC46AFC198F83F7A77C; // 0x0918(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_019518004A69FFED3A4B429D2DD4050D; // 0x0960(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D8A353BF42F04B354BA01B81BA2E937A; // 0x09A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8335EC474E6B2412C84D1BB852E11254; // 0x09F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7010D34744136EA3639C0E8186E01624; // 0x0A38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D75F140435C487A2FFC6CBCD7E7C337; // 0x0A80(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AC566B7D40CCFC6667B9B3B9C1295448; // 0x0AC8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_05FA0EBE4F660B26C45FA89CF55B7CCA; // 0x0B08(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6ADEF3144F0A7F4DBA0034AD714F9DEF; // 0x0BA8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B949BA1A4E280BFA4C61E6948E72AF87; // 0x0BE8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A6F85EF14309A3FE1B9975B61A75809B; // 0x0C88(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCC7BAFB4CB42918D714A2B224825F3F; // 0x0CC8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5DEBE6CE45BDC69F93679E9B324FCB41; // 0x0D68(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_33C60489457D0458E176A89837FF9D88; // 0x0DA8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A3805E614DB02684855F898C18420375; // 0x0E48(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB43C29648901ADF8635638BD93252C0; // 0x0E88(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E3CCF33F4CC3A7619C541F9807EC58B3; // 0x0F28(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28CD7246437E04ECE674D7936AF7DACA; // 0x0F68(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B4D2D205480392F0C1F332AE2A5473F1; // 0x1008(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0772C1EB4701A7BD9AF225A9DD827E0D; // 0x1048(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3C2361BD4A57BF946F808F9CAC0FFA17; // 0x10E8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F30557694DE5ACF995D30092C511EB4A; // 0x1128(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AA951EDE4F41CF7E433F62B3A35A1988; // 0x11C8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD1CCD654BB63B35021117917996E3F5; // 0x1208(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_87036EC94CE8A1018EE4EE84747B24FC; // 0x12A8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8363436D491C496DDD98678DC11C518E; // 0x12E8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_088B962F4AC3E8DE169DADBC8CDE4189; // 0x13C8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ABFE5EA24D527F891F965BB5D514C68E; // 0x1408(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8BE85F2942EA7ED1135BE59F91366547; // 0x14A8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0ECA850D43826402CC72D78CAFCEC345; // 0x14E8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5E69542E4A98A322F6B532BF1D88E681; // 0x1588(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DC65140F4DFA28CC90A71998B9AE9010; // 0x15C8(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BB92C74A45B0A975DBF8D08C57956624; // 0x16A8(0x00D8)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_A320B76A42C371CE7ADD948A4C3FA08D;  // 0x1780(0x0240)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_7EB6DB5846089033B7A3BFA90E27DE25;  // 0x19C0(0x0240)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4F372C80451E4F772F51A19C2EDE6A61; // 0x1C00(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_25E9409541579377EDAAB2B11CC7489F; // 0x1C48(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_66677ABB46B4FF83A33E969A47E97278; // 0x1C88(0x00E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_381290C54B886966E0F89EA6845BE0C0; // 0x1D68(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6AF660314FFFA400BC00EDB8F6105E68; // 0x1DA8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_590761C249C5CF8D3AF7769970D7007B; // 0x1DF0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0F130E3C4D9036A05FCAC2ABFAA5719A; // 0x1E30(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D13887B743A7C63611331AA5D3612EFE; // 0x1F68(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_82732739470A7ED84A6B5395823307CB; // 0x20A0(0x0138)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_52A4AAE74066063827044A9EA89330B5; // 0x21D8(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C12D347845CF8C3B88F7B89844E3C6CA; // 0x2218(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5838962E44496C01779718B47CE4B55C; // 0x2260(0x00D8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_34F3E781493B5EDE4017119DA464E3B4; // 0x2338(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E8ADEC0E41185CBB2F5D37B52199324E; // 0x2418(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E415DE5B44D657CFD77C67BB168CA643; // 0x2460(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_95414865479CE8574E0D56AFDAD055B7; // 0x2540(0x0048)
	class UParticleSystemComponent*                    WindParticle;                                              // 0x2588(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*                    StarParticle;                                              // 0x2590(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Dinosaur_AnimBP.Dinosaur_AnimBP_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_8C83A9A94908DD75C474FE830A229DF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_7FE744BB4A33B0B255897FA0816B6F94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_6C418AE849214B9CEF1EF7872671A52B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_87F143AE415395E1D25E65925284CB97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_F62CC79C45819CC46AFC198F83F7A77C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_019518004A69FFED3A4B429D2DD4050D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_D8A353BF42F04B354BA01B81BA2E937A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_8335EC474E6B2412C84D1BB852E11254();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_EE92E1BA444CBB9B9708E0AAAFB3A2AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_7010D34744136EA3639C0E8186E01624();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_2D75F140435C487A2FFC6CBCD7E7C337();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_ECB7765A462C0697B5DC40914C09FB10();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_296757084DF263AEB3BC55A33B234ECD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_AF385665495E0BFBCDD97A8F452A056B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TwoBoneIK_A320B76A42C371CE7ADD948A4C3FA08D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TwoBoneIK_7EB6DB5846089033B7A3BFA90E27DE25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_BlendListByBool_66677ABB46B4FF83A33E969A47E97278();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_B31521B54C42ECB4EE525695419EC745();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_3DFC75D847534F9F54BE85BD4B10B560();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_CBCCF84744C6BEAD2BA568ABE337745C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_0BAE200B4D0CCB7EB8AACAA5EC99E468();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_FFC38A664A93B2E55B5FC194D66D463A();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_StartState();
	void AnimNotify_EndState();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dinosaur_AnimBP_AnimGraphNode_TransitionResult_B2ABF2014A6222B5482F7C94B819BA3E();
	void AnimNotify_StartRunLoop();
	void AnimNotify_EndRunLoop();
	void AnimNotify_StartDead();
	void AnimNotify_EndDead();
	void ExecuteUbergraph_Dinosaur_AnimBP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
