#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FlyingDragon_AnimBP.FlyingDragon_AnimBP_C
// 0x17F8 (FullSize[0x1BF8] - InheritedSize[0x0400])
class UFlyingDragon_AnimBP_C : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0400(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_FABF4D64419B9DB260512BB6A43BAEA3;       // 0x0408(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13166B49485153112C1D9A98F48BDE0D; // 0x0448(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B7D1FC24A1009809666508B264BBEC7; // 0x0490(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DBD3294D437CC0D734698D96D4CFBD98; // 0x04D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38EFFD1448B05828ED8A1692F986A361; // 0x0520(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_749C4B93454957C06DCB918FF108E26E; // 0x0568(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4D8828304FEEA6ACC8F4D1A15AFC0AD4; // 0x0608(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31AF80284AE85D66F74984A4CDF5400E; // 0x0648(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D68292CF44EF7DCEABB9D68FFD72603F; // 0x06E8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_74FECB4C49D7FA7B75E0549B7DD4C3B6; // 0x0728(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2ED97D03475CFF66664F76AF8473CCA8; // 0x07C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B83310E249173A28A9675D881F3FC104; // 0x0808(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A071D7224B3C5071FCF3C18D535D7596; // 0x0850(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27DB154B434B32490BBB70BCB56F2DE9; // 0x0898(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13D2DBF245F80308742E429D764B52C7; // 0x08E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A643862F4443CC918B753C8490E2BDC3; // 0x0928(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9921AA6B4A5016BA3E1A638F9104644A; // 0x0970(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_161EC4034715409A99CBDCB0F590EF44; // 0x09B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52E2F3484C9E134F501CF399C9BAF333; // 0x0A00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_363B34604B544DCEC827A6A10DA5328F; // 0x0A48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44462DBB45296E8999AB658ADF3C642A; // 0x0A90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF32F14845E8099A419E6A945BF24C5C; // 0x0AD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64E12CF748146BFA1355C1BAEF959CC3; // 0x0B20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58FAE6DA492CD2533A8BAFAEA5A783C6; // 0x0B68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E8969FF4CDCC6DEDDBFFF92697E9D4A; // 0x0BB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3ABC0EFF491118E11A911FB6B4B9A08C; // 0x0BF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2071DDC1433622CB29FB8882247C409C; // 0x0C40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73F62AC1444EA18AFF3032B5061E23B3; // 0x0C88(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38396A6448189C89DD02418CABA54009; // 0x0CD0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E4E07FBB494EBB33123635849A0EFCDA; // 0x0D70(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91453C274354B0A283E86F98699BCF77; // 0x0DB0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FAD955E6430B609ABEF6B5A7E8CCB9C9; // 0x0E50(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18825E36447CA9F31DCFCAB57C71FFAC; // 0x0E90(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_24D1A96B44A62C5264C6288C3924EAEB; // 0x0F30(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30639A3A44E23C73568DEB82809FCA5E; // 0x0F70(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A5F358A54EAAEC9216FD89892ACEBC45; // 0x1010(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_724E3C9A487B97B8AA042BB5524AD2C0; // 0x1050(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_84CD129149F7FE9F7A81578FDCA29C9D; // 0x10F0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_988CA37747AC2C926881859C8E0FACF1; // 0x1130(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_65B7B52743C4C71489D30D958305261B; // 0x11D0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3464B29E41229658A0D76F8D8620780D; // 0x1210(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B6EDF3F34648A6B9E2213CA9B37FF979; // 0x12B0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F2B1B8FB4858636932F8639B152818C5; // 0x12F0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DFB1A7BF4A0A7ECB6C7FDD883A226F34; // 0x1390(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_70B8CC5D4CD4D6432E7FFDBEAC74CD1E; // 0x13D0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2691E03A4BCA6EC1EBC9DB9F05379F89; // 0x1470(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A9BDBD634C9A3818B9C82F809701FF16; // 0x14B0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D4B1D09B47D0D83D48DB80B99C6607FE; // 0x1550(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_06F4D10F425F33BF0F5C85AAD025E4A5; // 0x1590(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_408578794234B197D2517089D7EC0678; // 0x1630(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C6804E048F0543FD15C709C223CE2D5; // 0x1670(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_678714B7473C339F21824C8DA6D915E5; // 0x1710(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_92EB15C34B90B2BD3BB46FAEDAEC63EE; // 0x1750(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_92372307480B730C75EDBEB10313F7B1; // 0x1830(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_128F249241E70DFE0F14B69501D98AFA; // 0x1870(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_4012C90043EF8DA00CE151B701B0CB7B;       // 0x1950(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6B752FB5465760FC88ED78B383DFB7AB; // 0x19B8(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C3FB0AC64B928DBF6ED4B49DEC63D497; // 0x1A90(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6A47752A45ACC428D39A81ABC88CBBAC; // 0x1B68(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_973EA4E54A4FE999CA6486B422FE9F24; // 0x1BB0(0x0048)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass FlyingDragon_AnimBP.FlyingDragon_AnimBP_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_13D2DBF245F80308742E429D764B52C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_A643862F4443CC918B753C8490E2BDC3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_9921AA6B4A5016BA3E1A638F9104644A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_161EC4034715409A99CBDCB0F590EF44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_52E2F3484C9E134F501CF399C9BAF333();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_363B34604B544DCEC827A6A10DA5328F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_44462DBB45296E8999AB658ADF3C642A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_38EFFD1448B05828ED8A1692F986A361();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_DF32F14845E8099A419E6A945BF24C5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_64E12CF748146BFA1355C1BAEF959CC3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_58FAE6DA492CD2533A8BAFAEA5A783C6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_2E8969FF4CDCC6DEDDBFFF92697E9D4A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_DBD3294D437CC0D734698D96D4CFBD98();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_3ABC0EFF491118E11A911FB6B4B9A08C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_2071DDC1433622CB29FB8882247C409C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_73F62AC1444EA18AFF3032B5061E23B3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_6B7D1FC24A1009809666508B264BBEC7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_13166B49485153112C1D9A98F48BDE0D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_B83310E249173A28A9675D881F3FC104();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_27DB154B434B32490BBB70BCB56F2DE9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FlyingDragon_AnimBP_AnimGraphNode_TransitionResult_A071D7224B3C5071FCF3C18D535D7596();
	void ExecuteUbergraph_FlyingDragon_AnimBP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
