#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass GeneralDemoAnim_Base_BP.GeneralDemoAnim_Base_BP_C
// 0x22C5 (FullSize[0x2665] - InheritedSize[0x03A0])
class UGeneralDemoAnim_Base_BP_C : public UATGeneralDemoAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x03A0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_76BFA2C549FF39544996BF92C74466B3;       // 0x03A8(0x0040)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D6DFD3864EADF254100A9081D2EF7F29;       // 0x03E8(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_47FA01C5407E0BEDA46CCDBE9FAF7374; // 0x0450(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_001D470745C0E4A2E57F0CB0B8E68F03; // 0x0528(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9D21A11E4B98A1AB3607A795CFF2BB15; // 0x0570(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90B6959C41EA73C05BCE62BBF3176489; // 0x0648(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_444B6F6A461E1AC26EAD6B88E3904291; // 0x06E8(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_823767B44E51D3235A7704B28411CE45; // 0x07C0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_494F42534B18AE89ED78C7A24534B500; // 0x0898(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7777CF2D415318D2FF56A88CB4B03B35; // 0x08E0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E266E1A64F349501C4C202BDF2CF1AE3; // 0x09B8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1D90FDF64D44C66B2F75C0838C1473A9;       // 0x0A00(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5FB8D9394B4465E1846AACAA2651B153; // 0x0A68(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5D8BECB741919160DAC8C2B9746DB5AB; // 0x0B40(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_22BF0D3F4E0BBD2606764BAFCF1E004E; // 0x0B88(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2753B31B4CA4FEEA3B930B9D01D79886;       // 0x0BD0(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2A7C03E4467AA412FF5A3D949AE1BC74; // 0x0C38(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_31DD18BB45B2E2E500D047A8F14A9CDF; // 0x0D10(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BB79CA294E2AC3C0641D85BF8E5ADB5A; // 0x0DE8(0x00A0)
	struct FAnimNode_MultiWayBlend                     AnimGraphNode_MultiWayBlend_401655534FBEA0422DDE09B408B3CA7C; // 0x0E88(0x0070)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A0F265144A17FD6C0250C380522C1985;       // 0x0EF8(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0327673E40650C6073F2E0ADB80B2241; // 0x0F60(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C1689E094EA2D527895A0FB05A021D54; // 0x0FA8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_58C2D1D144F47EC8F9BF97B3E8E4277E; // 0x0FF0(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_614F79504C3D27F156526A8BD9E8FB22; // 0x10C8(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_AC0CD9EF4132C78D449A368A771C75CE;       // 0x11A0(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_729E62A84EF7FCFCF2C3A4B252498280; // 0x1208(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6281C51A4C259387FBFD77B5BE6B2FFC; // 0x12E0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EFD39D4047A864E4947F678B5ED9709B; // 0x13B8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0EE942B2476DF3ECAEB6C2B28492D8EF; // 0x1400(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_11781A8D4C29673B3F11148B50AB3749;       // 0x1448(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_85E418A74A29CC0E783B6F8C6E60AA8B; // 0x14B0(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BD8FCC514C4E35D49206FFB119A0CDC6; // 0x1588(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AE397AEC4F7AB5FDE7A3628FA7A2B1D8; // 0x1660(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1DB7D7634C2B189535F2C699632DD93D; // 0x16A8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FB391A5A45F46ED378D3BA93CA54D8BD;       // 0x16F0(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_23C58F5E4C475D03D08CE6A553F3F956; // 0x1758(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B178E715442C926C45C7A2AFE869BDBC; // 0x1830(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_491B23764E719D5ED123D18CD4573A1A; // 0x1908(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_158696F24092C81CF65D60A7FB8C201D; // 0x1950(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_AC73CB564B30685CA311BFABE3FAC57F;       // 0x1998(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E4C4D1A64146B6013B931F9C5AB79D52; // 0x1A00(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0FAC8E9041DC7408B813F38135FB20FD; // 0x1AD8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BE08185D45272EBB2163E0BD08D4F244; // 0x1BB0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8D51504742DCBD6FAD1D2C971B1524D1; // 0x1BF8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AEE1451C417DBE670174039CE0C1BDE2; // 0x1C40(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A58DAB1944FF1B1E7A50599123B2EC90;       // 0x1D18(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_45117E2B49DF5B88B56767BE99A50CE6; // 0x1D80(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_71BCCDBE4DEE437926FC2499F935EA96; // 0x1E58(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_047B1CFA4B86547A8604E8AB0D1D5140; // 0x1EA0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FA02558146263182B7765C9C199994C6; // 0x1EE8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_231B80834777B62002032482F2B3B000;       // 0x1F30(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EBF610734C68DB6853C1019031E5EAB0; // 0x1F98(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F1CDAED046952CDCCDD77E9A2C53BCD9; // 0x2078(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_425309A7412E758A91230994E98DCFD2;       // 0x20C0(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C864100A4893AE29EC5AE894814E3843; // 0x2128(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EEC52D804B6DBE7ABBFFEB8CD5552BBD; // 0x2200(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_49C7FF30435B0C7DAB1D789D4EE76FC7; // 0x2248(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_169744BB4FD9DCF3DDC57CB2A7F38628; // 0x2328(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F99F6A6044F5ED6E734479B3A747C5C0; // 0x23C8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CB64013046AC872DF42842920ACB25CD; // 0x24A0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CAFDA18A467DE6D12B4E10BAFB439D9D; // 0x24E8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A9180E904B093203BB1C3D9C6BAB4E08; // 0x2530(0x0128)
	struct FRotator                                    HeadRotation;                                              // 0x2658(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               UseFootDefault;                                            // 0x2664(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass GeneralDemoAnim_Base_BP.GeneralDemoAnim_Base_BP_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_GeneralDemoAnim_Base_BP_AnimGraphNode_BlendSpacePlayer_A9180E904B093203BB1C3D9C6BAB4E08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GeneralDemoAnim_Base_BP_AnimGraphNode_BlendListByBool_EBF610734C68DB6853C1019031E5EAB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GeneralDemoAnim_Base_BP_AnimGraphNode_MultiWayBlend_401655534FBEA0422DDE09B408B3CA7C();
	void ExecuteUbergraph_GeneralDemoAnim_Base_BP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
