#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Mob00_AnimBP.Mob00_AnimBP_C
// 0x56F9 (FullSize[0x5AF9] - InheritedSize[0x0400])
class UMob00_AnimBP_C : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0400(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_B55C785044A27A6EC2262D931D918772;       // 0x0408(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0AE630B4529D28CBD126FA8CF48DB1A; // 0x0448(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6392014F45D4E3F55796FEA95345BEA5; // 0x0490(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A71BCA544F679455A4F2ABA5D86DAD9; // 0x04D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_627C393548331C15B15D008C1BC2AD6A; // 0x0520(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_909E37A94C7EC460E75E7DB7515B33D2; // 0x0568(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9745C6B4172D3A6CBBCDFA0308384E4; // 0x05B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A5BF093349A069BCE3AA4F8C3B589CF0; // 0x05F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A246509E4159EECF718EBC97A9F8505C; // 0x0640(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E03BD24E4CC72CFEAD47FA96239D8F38; // 0x0688(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F922521540DD1BF9A30A9CBBBBE7873F; // 0x06D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3712BF83479C81E15B2A458A368B5CEC; // 0x0718(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2FA6E8D7457D735D3C482F81307698F2; // 0x0760(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01F45D4140E645902271DAB20551B760; // 0x07A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B14256BF44E1F32E6E1F16A464510139; // 0x07F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E7E97916435F177D2E70BAB9FF1E46B2; // 0x0838(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_775589B64A317DDB4FCB2EA68457BCD6; // 0x0880(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFFFE9AC4D7788C465C7CCB3606394B4; // 0x08C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_277B1AE243C2C5CCE45D94AD05BDF7D0; // 0x0910(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_99CDCD1640336711C2F4518A5C770B50; // 0x0958(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_06A6CD4945EEE616FD9B52850FF64B0F; // 0x09A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_925FF1FE4A87A19246AB1DBE0D63AA11; // 0x09E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F497DB314489C19D6DD00A951B31483E; // 0x0A30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1264716546403EE08D6CCCBAB508D12C; // 0x0A78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFE182C74E8353AC0241868F3DB7939B; // 0x0AC0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34D9DB0B4FC853A0E08B0BB42F6236DB; // 0x0B08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B1AD9ED4C7C07C94BAC9D93CC78E4C0; // 0x0B50(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E95893B64BA4921598D5699231C7A0F2; // 0x0B98(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D90CCD8E43C42187E8998589619406E6; // 0x0BE0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A032262487690D826C26B9218C9AC3B; // 0x0C28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21070E024EC3403CD00E929ED060F748; // 0x0C70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1656345D47BB26E2FDD288B65E9B8574; // 0x0CB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1B6DE7C4DB4C8FC964A20AF3CF77734; // 0x0D00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A09F1D0E430944D78692F1AD1362DF1B; // 0x0D48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2A733DF248FA45B7BA963FA379E17CE1; // 0x0D90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7ACE76494FEFC7312589468412D34B56; // 0x0DD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D940BEB4E77B8D1714A138204290A03; // 0x0E20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E904813C4BEE0FB6A38AC4B3FA32F574; // 0x0E68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_988403664B95FBC6FE2358B93228C5B1; // 0x0EB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C0BCAE3C42C081D4C44117BC06566455; // 0x0EF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47481A1E455119D41727AEA53213F7C6; // 0x0F40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69F7F3754B3A664DF00569BCCA16C9DE; // 0x0F88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E084029462C1150C422958CC0A9FD56; // 0x0FD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_618D0595453B39AE3DBE3D83EA1400DE; // 0x1018(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA1CEB0843C11E738EE5838294C3B3C9; // 0x1060(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF44C23148827B3231A5D58687BB61DF; // 0x10A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_252D66D3487BFE5AA6416CA8331758C5; // 0x10F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62699C9E48A1CD3CD3C7A5914E5496C2; // 0x1138(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD64F4B74AF0D8A0A470209E0DD62F18; // 0x1180(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_04ED5EDA4EE3032220F1E5A9925C1FE6; // 0x11C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD10C3D9425C8B4D88A5088B0BF1B21A; // 0x1210(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_495891C74588670751ACE3A817E84A0E; // 0x1258(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED7EBBBF462DAEF2478FA980F90FB147; // 0x12A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB04EDD0413C37883069ED851D916F74; // 0x12E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F6B261F481C68ADBC4F9BA785C543DF; // 0x1330(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1CFD03CA434CA2FE2ED231A2E8897538; // 0x1378(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_438F66FD4F4153ACAA66098C28BE97D9; // 0x13C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C21714A4F1829438B0158A4BA253A47; // 0x1408(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB83F6154667033010E31BBF945B39A5; // 0x1450(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4348E18642B8931D88EB9E878EB64136; // 0x1498(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95DF8289414FE0B36C34C59BF8085696; // 0x14E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82F284EE46C114AD4E0B6BB8B221A89F; // 0x1528(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_985C01D74916F7B5CAB41782E329D560; // 0x1570(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B95C5B3B493A6F9DDD3843B81AE4E30E; // 0x15B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB4A77B1454D6B22EEE7038CFB249C99; // 0x1600(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F3A4EF9492A1BB0A9E8199EF9628E3E; // 0x1648(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C458A7B644F0999E52E371A0E3A29AFB; // 0x1690(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6322AD02498B01728F1C6CB27B8C9AFB; // 0x16D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FAECE754BE6723D17C34DBCBBC63283; // 0x1720(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61EB1BE84EA0A07BCED80DA5D7321FA6; // 0x1768(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC1FDE07458876679DC18188432B69A6; // 0x17B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFD591874C7FE7FBF21319A8F7EC63D3; // 0x17F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C257737A41606494A97DC180B043095B; // 0x1840(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D15934F4AC5AD75BB1F70B868185140; // 0x1888(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A19F07F14C5D9B94226D559D651B5924; // 0x18D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ECF6257D4875BE7CFE06F98333B77A2F; // 0x1918(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_76CCCBDF49817FBA9CF588A8325BC26E; // 0x19B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C84EF7B04D836CC05A8CEF8B35E3B145; // 0x19F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31A35B9242AE17976C3766A23AF2B999; // 0x1A40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F6AD5AB452BB8740F6CFCA63C729FAE; // 0x1A88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6FBBDABC44E7D29261E02584DD289315; // 0x1AD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F441470F40F86D9D2C96F08EFEC5192E; // 0x1B18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2C716604AB5D2F01F5431BD74EF356E; // 0x1B60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3EB6CEE743FA19ECC3D426B5DFAAB8B1; // 0x1BA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61F6438E49A75D851408C68F88722981; // 0x1BF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B93FE6CA475C1D21C70AC8AAF56EE12E; // 0x1C38(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_48E230954CECBFC3CAF15FAD9C1E305D; // 0x1CD8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B4460B844D9A3B7C5E53578BA0CDF8C2; // 0x1D18(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_83BCE8AB42D5A0F50D3025B1764A27AC; // 0x1DB8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C11C84644A356375F507F193AE9F9B92; // 0x1DF8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_53FD443E45704063A19B29AE8E1AB753; // 0x1ED8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89B79B62470F532B7920F499FA781E9A; // 0x1F18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4839FAC94B9B6D8319DEF39B36C374FF; // 0x1F60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A3325C88439255E88F0A3B9E67CB9E60; // 0x1FA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1F85178B4992660238F472A0EAA5BC23; // 0x1FF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD99BEFC4F6C00012D7E1DAEC740A0C0; // 0x2038(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4322CD9248DED1C2CBFFEC9A01907EC3; // 0x2080(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77550E604E749ACAE3F7C1ABF72ECF2A; // 0x20C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E8C420D40B84172FED1EE81F373CDF1; // 0x2110(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_636EADC74A26AFF1C5A750A76272DA28; // 0x2158(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_87DEDD344A335647867D589406331FD3; // 0x21F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4EBB73B94430911F77F6C39A3A0399BC; // 0x2238(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CCE9EB1B4940F11B6D7E37AA7FEB58CE; // 0x22D8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_99968F4940F6F02491AB2095C3DA8927; // 0x2318(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C8117F89483272EE2C51CF9EF67B1C67; // 0x23F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E75AECD140EFED90DB2E46829C41503B; // 0x2438(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1BC443E348A7762DF5822D98E3CA0571; // 0x24D8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8E292084C74244537A565A64D5193AE; // 0x2518(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DA17D34D4E02468F2E1F9D9A39FB29C9; // 0x25B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_69B1956D4B5B6ABAFF065BB2DC241DEA; // 0x25F8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F2FDE75742B97684351682A327B4C636; // 0x2698(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCAB1DCD41CD8F775DC818AE65AA1862; // 0x26D8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_36D630154246B5D3E3730A8F2F1407BA; // 0x2778(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D6F4DA084A4974E01AACB7969AB2A8BF; // 0x27B8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4732136E4DF001A922B361BBCAB7B762; // 0x2858(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10DCEFAB4223C0DC1BCF09AC5FCD057C; // 0x2898(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8DAB86C247470D90A7C5A9B8840957B9; // 0x2938(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_37846A0E49CBDA8AE813AD80B61416E5; // 0x2978(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F93D73AF4DF215288FB55AAA338BB18A; // 0x2A18(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E13A4A7485201FD710656B8EA6EECFA; // 0x2A58(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C19D4CFF4ADF265A14B164B2FCFDFA0A; // 0x2AF8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EC9AB8B5447667717E688C840AFD66AB; // 0x2B38(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E1CD82AD43F7722BACEE6DB6AAA23039; // 0x2BD8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2CD0E5D0447A85838F259F943B35DFA4; // 0x2C18(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CCD1D0BF4308CD6A1250A2BCE0748A57; // 0x2CB8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DA0C3D74449E03C1572C738756A600F3; // 0x2CF8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8A43934E4475289FB51C5E99D560DDDB; // 0x2D98(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6BFF1DEC4B3341CCAD6EAF8D7AFDF1AC; // 0x2DD8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D416B6E64EEAA895FF7B2E9512B2E284; // 0x2E78(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F666D9B74E89869D8005EDAAEBC8DC5F; // 0x2EB8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_050E26D742EAD8403E2F8BB37CDFF991; // 0x2F58(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90F74CA64D640C09882CD290B39D85BB; // 0x2F98(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EAF682634282CC65B04310800B022B75; // 0x3038(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE88E4DF4771A8F0F4F0E08DC445819D; // 0x3078(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E2D99F9D4C1512FF91DD89967A27E7DD; // 0x3118(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4EEEF4DF46F994862FF274B2EEBAE834; // 0x3158(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A3723F34450ABA5ABB170486EC59A6ED; // 0x31F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8DC5BB234060C34CC42883816E7C0059; // 0x3238(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CB9064D4493B86501171BE87993207E6; // 0x32D8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1447AD4544A10EDEEC7A02A675359091; // 0x3318(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DE26B3DA4AC5D368C816F6B3D6199C72; // 0x33B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_637ED5E440566DB97B7384A49A9BC9D8; // 0x33F8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E5707F9A449864EA7A13E183FF7316DD; // 0x3498(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4799711C45C7D6131290AEB7BB898820; // 0x34D8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5C681194420C0E7C59B29D9796297A5C; // 0x3578(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_469D748446C53C4A91AC21873D8884CC; // 0x35B8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_52CF5C4E45847A958030BB8DA9180F17; // 0x3658(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_880A63434E10D3F01721C49CACCD309C; // 0x3698(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DA46AB374B71642F1AFE9887A6E38B3D; // 0x3738(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_190D5CFD4C41E389085B91B9A3EED499; // 0x3778(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6A71759D424DB980157919AF0B464B87; // 0x3818(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F0805EAA4EAEC3A8CCF2D3A81BACBF40; // 0x3858(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E9A49F1C4FCB9FC3AB46C0BE1339015D; // 0x38F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B51ABE34AF31AEE033C209C774DF9B7; // 0x3938(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EFB6B84D4308743D04776791AAFB64A0; // 0x39D8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F738CFAB47417E299A36F79AECCB80B7; // 0x3A18(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_52B643594F2A529E1B1E02973AD9D3BE; // 0x3AB8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_459D0A214BE66EE6E80B2AA89B4D8E36; // 0x3AF8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BD26ED42424A5A8B36D64D889567F06E; // 0x3B98(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DAD2F66A4AFD7F84140CB697986CCE7F; // 0x3BD8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6D330C8A4A09CF89FC768EA1AB397BAF; // 0x3C78(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2476A8EB412B2AAEB6B89491B9FB0164; // 0x3CB8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_180E65B14A4F603130C614BCA2659B44; // 0x3D58(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26ACF09D42807FC1629BC5B77FEFE6C0; // 0x3D98(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_44432A1E4CC26CEC27E48E8F7133B13B; // 0x3E38(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7B432DF4AB42C66BCD452B99FD857F6; // 0x3E78(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EB773C5B4A5016A586C313BD743643AE; // 0x3F18(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_299CA66041E57935E9F60099070F9CF2; // 0x3F58(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3616AC374D7EE1A3A0884D8BCB897BFC; // 0x3FF8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9F3000E24D022429A3FE68B9C9A6D38B; // 0x4038(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F02D79654CA8FE7394DE2EBC0A182A9B; // 0x40D8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AA15F97049888F4FCA4C3C97109156C5; // 0x4118(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_65ADF5E04BE13D533E1BF5863FFEC056; // 0x41B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56E2B6D74276D704960CC9A6AF30BD07; // 0x41F8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_433A67A24B691D41C17123B425D841FD; // 0x4298(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5502C7E04515B3CB809E32B38DC97E6E; // 0x42D8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3BD8873142DDBD5A7785D692FBC79024; // 0x4378(0x0040)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C6F7CD8340109439469E71830B391A75; // 0x43B8(0x0040)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5BCC87AE463FA3F8367D35BFBBE42A27; // 0x43F8(0x0040)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DA45A56F479AD56F3FD0688E8B822524; // 0x4438(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_646DF4554AD3170BE32FB983049D7C86; // 0x4478(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C53BBB2B4C9BED1C30F172AAD9B0073F; // 0x4518(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13F6081242649CDF7460B18354DA12D2; // 0x4558(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BC06C40B42E116F1ECC6078E8E9EF461; // 0x45F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B1E4D323448CF73AA84DAB89BB6F929F; // 0x4638(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A34D1230465D83B2A8A08F902237093C; // 0x46D8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_09432717452A8FF2719C269E73B6F695; // 0x4718(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_678714B7473C339F21824C8DA6D915E5; // 0x47B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B6B40DB427CEC06AA95EF9250B69C2D; // 0x47F8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8472855B4C4F540916A4E98EE78D258A; // 0x4898(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_91211DDE4B02AAF2C5D99598993E3CBA; // 0x48D8(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_56E71AEC4515D49D41E0D990EAEBA369; // 0x49B8(0x0138)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8699C56948824D092AE2F38AE4B875CD; // 0x4AF0(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3965A3EE40AE7854AB96EC84E2D8EF2F; // 0x4BC8(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_7DB779E8468EF10DB92994BC71CAB2B7;       // 0x4CA0(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2DD6DCE046CBFCEC39DDF09BD49085E3; // 0x4D08(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B13925654B4786FDC031A69C818DB7CE; // 0x4DE0(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_554F2C584D14000E56847193F1DB8229;       // 0x4EB8(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8A93C901485D48648309058C78B16326; // 0x4F20(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_218324694C33A92D47DBCF8DCA309C77; // 0x4FF8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_25F29FA04EF96CE71E7ABDACF348136D; // 0x5130(0x0138)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A9BE0A3F40A638924785BEB7C55D84CD; // 0x5268(0x0040)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0BC467094FD18AD659E7DAAE7F644117; // 0x52A8(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_02DC021F40A325B5235C108AF890C7DC; // 0x5380(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_BDB0D8824549C9B4E8306EAA4F00937A; // 0x54B8(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B2E5A75A47561B8E4EFEB594EA1B1B05; // 0x54F8(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0F2FD22F417228F824F30C8F508A9DA0; // 0x55D8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3104B6E34AAC0CA6A305C5A1AAE06BD1; // 0x5620(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4069EA1548BF625F0F33329B61A3BBEB; // 0x5660(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1F0D863F49624ACBC9102C964F1AF36A; // 0x56A0(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C866C9F841553C9063219B8D3A0CEAC9;       // 0x5778(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3A0E1C1C463C3EB83A89229700C480CD; // 0x57E0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F064E1114A367988528A40BECDFD4897; // 0x58B8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EAD032F44B6DB2B43FDCA798EE7694E4; // 0x5900(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C63A449E4DBFF1A17ECECF8BE1A95DBC; // 0x5948(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B92FDBB347750532AAA5B3AAA95C42A6; // 0x5990(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2D2E81AD45F5680DD3B702A901E71D43; // 0x59D8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_665169A54414745A9278738A83EBBDB6; // 0x5A20(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7884B4BD41D6C7AE07C372B384BE6348; // 0x5A68(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CB2CBF5144F8A30A1643B199AA30CB5E; // 0x5AB0(0x0048)
	bool                                               NewVar_1;                                                  // 0x5AF8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Mob00_AnimBP.Mob00_AnimBP_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mob00_AnimBP_AnimGraphNode_TransitionResult_A09F1D0E430944D78692F1AD1362DF1B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mob00_AnimBP_AnimGraphNode_TransitionResult_2A733DF248FA45B7BA963FA379E17CE1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mob00_AnimBP_AnimGraphNode_TransitionResult_1264716546403EE08D6CCCBAB508D12C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mob00_AnimBP_AnimGraphNode_TransitionResult_7ACE76494FEFC7312589468412D34B56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mob00_AnimBP_AnimGraphNode_TransitionResult_2D940BEB4E77B8D1714A138204290A03();
