#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass RidingAnimBP.RidingAnimBP_C
// 0x12C4 (FullSize[0x1824] - InheritedSize[0x0560])
class URidingAnimBP_C : public UATCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0560(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3E3C4D924451C00B13D25499E56A2F57; // 0x0568(0x00D8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_257C1AE74F15F1ECB644049747861C1D; // 0x0640(0x00E0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A000A6F9481F1B073C759B9B62009280; // 0x0720(0x00F0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3D454D44AA27FB0362C5588B7EA7FC4; // 0x0810(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C9C0C5249D9A55F4E346D97AF823B99; // 0x0858(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FB150F5464D85EC597F49AEFCAAAC46; // 0x08A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B13871748E2F9ECF894BEA33C5DFCC6; // 0x08E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D714E99D4C2C6A940A013A95904F531D; // 0x0930(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ADD80D9240C39BB4B8D2D2B1D24638F6; // 0x0978(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_566E78EB4D96E89C7CF6069EA3B3481F; // 0x09C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FCA576B418A41FD258113A33F7A0DBA; // 0x0A08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_008B345844A19065F84E4888A9625879; // 0x0A50(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E983891488BC22FE71146BDC61D9E71; // 0x0A98(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2BA95B05482A20C6B3F1AEB68BFB46F3; // 0x0AE0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_287C00264F6881D6F2B38B82E63850AC; // 0x0B28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E48920934239D4539A5F559BCCC9B0DB; // 0x0B70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E62EE66942499497D5F33E809675E0A9; // 0x0BB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AE528D449A8CFC7C989058FED2A5EF9; // 0x0C00(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4792BA3A4290EFE4E394A3B875FF3C15; // 0x0C48(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8B39A8324840A187BEB279BCB0F3A665; // 0x0CE8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_008CBE894C3A355B94FCEBB626EE2FF1; // 0x0D28(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E1D2208045A2BD726BE6778BD9E54392; // 0x0DC8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_504F63E74CA8184750E771A9C9A3EC2D; // 0x0E08(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D24A739142454461BC1BD7BAED17CC6A; // 0x0EA8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2A90AED34D1BC8B6BAEB96994CADFC78; // 0x0EE8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8002491441EACFB4B07C23B1938886D6; // 0x0F88(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A1FAB5AA44BE8EEE42C78DBB3F9DB17A; // 0x0FC8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9A25762A4BF8391C66ED7495C391004B; // 0x1068(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FEA3B35C4063ABB71513A1BCE7B45831; // 0x10A8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C6EC970943991B2FAFC04FACF717AB12; // 0x1148(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6C07CB714EDB43D8AB52E3B801C77B24; // 0x1188(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_82DF16C54B1E0F9E2882CFBE7D7FD7D0; // 0x12B0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2EB70AA94FCAC2956E9F7FB9386A7A43; // 0x12F0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_Root_C84A21E1451568DFFB31D7A0D8FCFF96;       // 0x13D0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C48C6FF24199E8BBAB4C21ABE6DD5F4D; // 0x1410(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_26C6C4AB41840BE1BAE8FF9A563289C4; // 0x14B0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7AE7583A4D1AE7FFC6935D9F39511978; // 0x1588(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_75D6955348F1F74667B106B91D968369; // 0x15D0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CFFB913B42AEF739CDE4ACAA37D9D497; // 0x1618(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_02C46F144A93BD096C0842847F9AE9D9; // 0x1660(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_69A5CE4B42CEA27ACEFDA085F21523FB; // 0x1798(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_589B900D4E27FBB8D4D1FAAED67E5988; // 0x17D8(0x0040)
	struct FRotator                                    TestPelvisRot;                                             // 0x1818(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass RidingAnimBP.RidingAnimBP_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_566E78EB4D96E89C7CF6069EA3B3481F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_4FCA576B418A41FD258113A33F7A0DBA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_6B13871748E2F9ECF894BEA33C5DFCC6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_008B345844A19065F84E4888A9625879();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_3E983891488BC22FE71146BDC61D9E71();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_2BA95B05482A20C6B3F1AEB68BFB46F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_287C00264F6881D6F2B38B82E63850AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_E48920934239D4539A5F559BCCC9B0DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_E62EE66942499497D5F33E809675E0A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_9FB150F5464D85EC597F49AEFCAAAC46();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_7AE528D449A8CFC7C989058FED2A5EF9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_2C9C0C5249D9A55F4E346D97AF823B99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_BlendSpacePlayer_6C07CB714EDB43D8AB52E3B801C77B24();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_ModifyBone_02C46F144A93BD096C0842847F9AE9D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_F3D454D44AA27FB0362C5588B7EA7FC4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_ApplyAdditive_A000A6F9481F1B073C759B9B62009280();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_BlendListByBool_257C1AE74F15F1ECB644049747861C1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_ADD80D9240C39BB4B8D2D2B1D24638F6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingAnimBP_AnimGraphNode_TransitionResult_D714E99D4C2C6A940A013A95904F531D();
	void ExecuteUbergraph_RidingAnimBP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
