#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass TownTalkAnimBlueprint.TownTalkAnimBlueprint_C
// 0x603C (FullSize[0x658C] - InheritedSize[0x0550])
class UTownTalkAnimBlueprint_C : public UTalkAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0550(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_C80E8DB74FF462FA9E42B59147AE1ADC;       // 0x0558(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4CF1016F4E4AC5DC8201D29A536B8BF5; // 0x0598(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F83B8EDA4D5BF90E67FA15A11D9EF1A8; // 0x05E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B89A6A24FEC6DFC0280E2BF271FBCAA; // 0x0628(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFCEF77A4F1C5242828F998E2A13AAA5; // 0x0670(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4525859F4E6D0CCDA5EA789546917FFF; // 0x06B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B2DB34848A21806E645D5915CA3897B; // 0x0700(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF05318047A4338B92A620AAD3662225; // 0x0748(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_992DBC73415BC079FC73E688E06B6928; // 0x0790(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E7031B9446FB84EB7CD057B6F539F7E0; // 0x07D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F4837FE46DEFE27BD9541A08BB2C357; // 0x0820(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E89D23A4CD9486E8C9F03A050BC054C; // 0x0868(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D7DCDE164C06F051EF82B6AEEB078C2B; // 0x08B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6ADD9B7F4240D11A1CC18F8E1A6772D6; // 0x08F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E5D280B04E358A02C982AD99C83A7971; // 0x0940(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8511E7684DA247FB009E34A2648A1633; // 0x0988(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D279DAA466B0DBC6CB5A0B85E2ED23F; // 0x09D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD7A28CF483E42AF42272BA868BBCC24; // 0x0A18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_847201BD4974EDE13B6FB7866F69AAA8; // 0x0A60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2131809C4BA79E8BE121239C56EC7F5C; // 0x0AA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D54BD7424E1E2C75D41969B29E6A4BD5; // 0x0AF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F82E7547438F42E9D623589514416461; // 0x0B38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A1E9B9534622458A42A216B2A8573231; // 0x0B80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD8FBE0C4DC9425483626F9866B30C2E; // 0x0BC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD0886034C6442EAF46B6C94A43C69FA; // 0x0C10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9A505414578B5BE919FA1A5CE050E39; // 0x0C58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_592515AB4A56CB98EDDA1E989433F7D9; // 0x0CA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_000EDEA34F85F057350C0191C437925C; // 0x0CE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6851EFB34A58C11EE25D35A0FA93B951; // 0x0D30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD82E7EB46245B699F96589FD043061B; // 0x0D78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C1EB7EE54C6C54205736ED829AD32453; // 0x0DC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EFF9753D46A3B5F109B117BE5D988725; // 0x0E08(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7A24D6441466711AF71B58FCE214A3D; // 0x0EA8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_66AA06674D49E82036F041B7105D101C; // 0x0F48(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_75A21F9F4BE6A898E2EE4AA197C3636B; // 0x0FE8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7E2CAF984D36A0783465B49F44552BCA; // 0x1088(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B8BC68164C43C872268C97BE8C9374DF; // 0x1128(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D8A362864765E388737CC68D32767A27; // 0x11C8(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1619CFF542D440A40D7BF0B614033A36; // 0x12B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C94DC914C440E1F84E12B8B1C9512C9; // 0x12F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1BC6232B44D1878735CF279CCE00667F; // 0x1340(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F209FCF4C7D80DCE98473B9C2BDC1D2; // 0x13E0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1D037CC940CADE05C789B7AC2C35688A; // 0x1480(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3840963E4E9B64670DBADC81D518BD3F; // 0x1520(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F8DE252A4EEB84B3A50F3181C6020DCF; // 0x15C0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F15D78FD40F9497C784F218B5C9E6A96; // 0x1660(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_EA8B593848ED2B3F8F296A91664698BC; // 0x1700(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DEF55BB04686046F46AF88B4DCCCB747; // 0x17F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E862E291469180065B650F957189C7FB; // 0x1830(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8C08FF042CC89B8A21485916CF2D287; // 0x1878(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_74AF9891495DB2D35A17C689B14015FA; // 0x1918(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1BBA2A8049A0C8B7DEAB19A854D1B214; // 0x1958(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_52E98C8546E41B332F489EBC641DDCF5; // 0x19F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_409FF5F24B4A4F5AC549E9ABBCD02E60; // 0x1A38(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7A43E74D42CDCBABC8143C899C2C68D8; // 0x1AD8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DB2FCD1C4E90D9F9BA5733B0FDCAD2B0; // 0x1B18(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_47870AAE4DCF9A8C4543178E87C93DCD; // 0x1BB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C9A2A8347DBD7E8993AF5B5C4E443A0; // 0x1BF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4FED9DBF4309C2F2AD4F7A874A39E814; // 0x1C40(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC6B41834F878116C73C80B7F53775D7; // 0x1CE0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_499CAB634C44EB1C0CE8B09141347674; // 0x1D80(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C57EE604A0ABD0E677FA69024DC14C8; // 0x1E20(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04A30D574B21DAF8F22A9A917948ABBF; // 0x1EC0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FF7A6E914A5B9C2511236CB075048893; // 0x1F60(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_050F555E40512CC28F34C7B023EC6330; // 0x2000(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DCC6F8184A40E7C718A059AAB341830D; // 0x20F0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E55A5E8A46C357C70A80A8A3FDC87BE0; // 0x2130(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_185F1DFA4085E3E2E4FFCAAC4CAEE9BD; // 0x21D0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B7867E164F21E34118C95AA6D800DD2D; // 0x2270(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7A0D7BCD43D19837D77E81A8D8AA621C; // 0x2310(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B50B8C9248E20DB0F186F0A416236314; // 0x23B0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C7CDAD14B3F1A92B42932AB85ED7C71; // 0x2450(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_BBC6BE6240B6A8D21D52A38FDB176438; // 0x24F0(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_60026B2943A3EA872594FEB410946585; // 0x25E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5D14B6FE4A70515861CBBB869FA524A4; // 0x2620(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7DF5ECE447D2779A75F562BCBE89305A; // 0x26C0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45D76CBF448AF63751D9169056AAACDD; // 0x2760(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E090B81043D6408D2E4E89A8D9F226E4; // 0x2800(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2483D78C462B94A7F930D8BDECACF3F9; // 0x28A0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_79A2981B4F44D38F936FBD8425E1BE75; // 0x2940(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_00B052984D94C756245908A5AF6B495E; // 0x29E0(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D4E6AFCC467F3F89A20563B18E175BC0; // 0x2AD0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E5828B214454A9E580963CBE049323E4; // 0x2B10(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8E9DE9A443C407AB48B8619EEE75E7E9; // 0x2BB0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_72484C7747337F9D6D628593232DC480; // 0x2BF0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_19D0ADAC45E9ACA6042553BA6C02139E; // 0x2C90(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_572392AD48B452C1C0A9BF80C63E1781; // 0x2CD0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BC90782348132C963FE8A095C595C5FC; // 0x2D70(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6185493A4DC5FEEC5F93259AD1730903; // 0x2DB0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AD0387EB49FB4010442437AD36B5F9FC; // 0x2E50(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_888A1210492F001CF71707A66A0399B3; // 0x2E90(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_784A8E2A4354C79CF4DCB295EFDB6E3D; // 0x2F30(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_69624E834598DF3522CD33896ED29686; // 0x2F70(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_78A8A40F4989509FFDEDB1A600C54DA7; // 0x3010(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B88C2D84D54EF0D7875788B1C5B37BD; // 0x3050(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BAF1B53A452D8CBAFCC6ABA877C5E63A; // 0x30F0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BF211DCA42038ED3807F9C9B688E4FEF; // 0x3130(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F16FA01048FEF24B5F974E9DD8131CC0; // 0x3210(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DDD803F44EFFD994E33510AF7F923F5F; // 0x3348(0x0040)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D8D559B240DC3C3A767B638DDBD3C8D6; // 0x3388(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E63A8CBE4A028ED3F2B4CCA9FFF4CEDD;       // 0x3460(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7B749DC54206F4B651B1CDA1BAB26DF4; // 0x34C8(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_99397C174BD169138CC071BD5F96359C; // 0x35A0(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0371B0F44DF40A0F1B3E8290178EE37E; // 0x3678(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7059F7BF401068079D4953A896FBC166; // 0x37B0(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_BF04AA6E43F9A25BDDC8388BE3A5FCC1; // 0x37F0(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3B00CFD3457F619AF5F5128126505FA8; // 0x3830(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B9B468A4423D6416ADE8BEA67FA2C025; // 0x3910(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_641B2BF444DD69A47E4EB2A1D783A38D; // 0x39E8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_03B616C34EA121FE3585AAA4658BF15F; // 0x3A30(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1BC9D681462AEA48E218488A7AA07FD7; // 0x3A78(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_72F92A5A47200C390D7AD5B619D30656; // 0x3AC0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C06DC1744763E7F53E944F9A85203BEA; // 0x3B08(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0F3E92BE4617E0A6D16A3D9B65818438; // 0x3B50(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CCBC4FA04521E81216A3EBA86B67ACFC; // 0x3C30(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0BEE41FB4CA53015CD7E2D9D45ED095F; // 0x3D68(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B672CBF34E6F1A4257D30CB9270392A1; // 0x3DA8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_1425821048130C1D3D0CA5883B9A5C8E; // 0x3DF0(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C71B1381486F56C37EC95BA3EE487D0E; // 0x3E30(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B54D822E481A9D15877E649DAF2C952A; // 0x3E70(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_83778D674B96742EA7BC78ABD9D653EA; // 0x3F98(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2C0D4DC84959A58683A00BACD72E7018; // 0x4070(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3DEE25D247DC1BAF9DFC69A26BC1FFDB; // 0x4148(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8E278C2E43F8D0B9DB65ACB0BA18CB51; // 0x4220(0x00D8)
	struct FAnimNode_TransitionPoseEvaluator           AnimGraphNode_TransitionPoseEvaluator_9B54E2A44DE57927385FEFA54358869C; // 0x42F8(0x0078)
	struct FAnimNode_TransitionPoseEvaluator           AnimGraphNode_TransitionPoseEvaluator_A3081506468FECF80FE170B5DD51A47C; // 0x4370(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_CustomTransitionResult_47C3731145AC112B1A59D383A879DD74; // 0x43E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF68636945734AC71F6FE1B9BCA24070; // 0x4428(0x0048)
	struct FAnimNode_TransitionPoseEvaluator           AnimGraphNode_TransitionPoseEvaluator_85E3963642F2331118549CBB7FE878AE; // 0x4470(0x0078)
	struct FAnimNode_TransitionPoseEvaluator           AnimGraphNode_TransitionPoseEvaluator_FD5D7C044BB908EDF83102A644EEDFE7; // 0x44E8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_CustomTransitionResult_6F9212DA4358F45189F5F581026FABEC; // 0x4560(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5744D61548C501FAB804E194B8DA6741; // 0x45A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DB8FF04D462BE6646A1BCB814996EFC9; // 0x45E8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A3DEEE8C4FF0E83B4751E4A5CBEE5DD7; // 0x4688(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8CE81434006F14F9B3EFCB1481DE99C; // 0x46C8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BB6B68834D0866465140DFACBA3E6E20; // 0x4768(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C36B6071410CC0920EB8EAAC7EDAFB1D; // 0x47A8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_73858E8F4D21509282F5AF938FA84289; // 0x4888(0x00E0)
	struct FAnimNode_ModifyCurve                       AnimGraphNode_ModifyCurve_D4A51D2B4A8C3C1206BEE4AAE12B11BA; // 0x4968(0x0080)
	unsigned char                                      UnknownData_DD43[0x8];                                     // 0x49E8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_LookAtEyeBlend                    AnimGraphNode_LookAtEyeBlend_32E21F3E47F77994E0D68292A621CC4B; // 0x49F0(0x0180)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3E67060F4CEE00825C365A9DBEA7BD72; // 0x4B70(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_794D9BC0469D96C7DACEAF955BFAB9C0; // 0x4C50(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_91F338664A16B5EF87A79683291424AC; // 0x4D28(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0308944C421647D456CC95963453A254; // 0x4D70(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8DA6A7144B3DAEB8A1F16F82285E94EC; // 0x4DB8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_23354224449F1B641977F2AC4DA3EA61; // 0x4E90(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_959DBE5342DA8E1643EBC98CC04A0AA8;       // 0x4ED8(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D7C6F1584A35E20852CF5E8174D409DE; // 0x4F40(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_056327254D71A52840911684786CC421; // 0x5018(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E98C7C7446BDFD9F8F364FBFAB4D46F7;       // 0x50F0(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0577F4D64F72EBD527069EA0823AB2CC; // 0x5158(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C8432B714C8BE2375F0698AA093BA9BE; // 0x5230(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D51E77344F82E970F2B892AC6705EE9D; // 0x5308(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6185CF1D43C170BB390D41921E08FD8D; // 0x5350(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3AF369D945D39D17FD8A4995B9E27946; // 0x5398(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_47F513A9479C3FD4EB37BAACC7C3466E; // 0x53E0(0x00E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A87469FE4996BE733695EAA35C08043A; // 0x54C0(0x0040)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E892310A44E3ED3628CD798C6168222D; // 0x5500(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_03F2AC77485D43E45CBF5BAEE45F93AC; // 0x55D8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_418AF60247B21A88D860DE94453666BB; // 0x5620(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2ECC651045E5DB10C880BEAFD1B0E423; // 0x5660(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_11F790D44F6DF141D1628494C49CD2E0; // 0x56A8(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_ED208E9548877076C2A8188072EBDDE5; // 0x56E8(0x0040)
	unsigned char                                      UnknownData_YZNK[0x8];                                     // 0x5728(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_984F2C694989026BF6E186BF03ABEFA7; // 0x5730(0x0280)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_0AD760DC4E3017C9E94BC6982097AEEF; // 0x59B0(0x0280)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_2FA2EDAA42320E38E1AB478D03B0A309; // 0x5C30(0x0280)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_BDB8B73A4764A148A3B5F5AD9749B526; // 0x5EB0(0x0280)
	struct FAT_TalkAnimNode_LookAt                     AT_TalkAnimGraphNode_LookAt_3134A7DF4F82F81755B2D2AB86BC8DD3; // 0x6130(0x0280)
	struct FAnimNode_ModifyCurve                       AnimGraphNode_ModifyCurve_B453DB794DF530548D621E9266A392FC; // 0x63B0(0x0080)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_32AEA0244FEE40D9B7614AA1C751C98F; // 0x6430(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0C634E624BF48FF2D88A20A9975E47D8; // 0x6478(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1BA9655A41354266C3B893942C9A8DF2; // 0x64C0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0733875B47B9B2C9003EB4A7F5E9D6B4; // 0x6508(0x0048)
	int                                                SequenceAnimationNum_Get;                                  // 0x6550(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsSlotAnimationExtend_1;                                   // 0x6554(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TEnumAsByte<AnimGraphRuntime_EInterpolationBlend>  InterpolationBlendType_Cast;                               // 0x6555(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	unsigned char                                      UnknownData_IJZH[0x2];                                     // 0x6556(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector2D                                   GetLipSize_1;                                              // 0x6558(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              GetTriggerThreasholdLookAt_Selected;                       // 0x6560(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              IsEnableRotateHeadBone_Implementation_Selected;            // 0x6564(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                CachedBlendSpaceType;                                      // 0x6568(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	unsigned char                                      UnknownData_EAJO[0x4];                                     // 0x656C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UBlendSpace*>                         BlendSpaceList;                                            // 0x6570(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                              IsEnableRotateHeadBoneAlpha;                               // 0x6580(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              IsEnableRotatePelvisBoneAlpha;                             // 0x6584(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              IsEnableRotateSpineBoneAlpha;                              // 0x6588(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass TownTalkAnimBlueprint.TownTalkAnimBlueprint_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_TownTalkAnimBlueprint_AnimGraphNode_TransitionResult_C1EB7EE54C6C54205736ED829AD32453();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TownTalkAnimBlueprint_AnimGraphNode_BlendListByEnum_050F555E40512CC28F34C7B023EC6330();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TownTalkAnimBlueprint_AnimGraphNode_BlendListByEnum_BBC6BE6240B6A8D21D52A38FDB176438();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TownTalkAnimBlueprint_AnimGraphNode_TransitionResult_6851EFB34A58C11EE25D35A0FA93B951();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TownTalkAnimBlueprint_AnimGraphNode_BlendListByEnum_00B052984D94C756245908A5AF6B495E();
