#pragma once

// Name: DBZ-Kakarot, Version: 4.21.2


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Wolf_AnimBP.Wolf_AnimBP_C
// 0x2B00 (FullSize[0x2F00] - InheritedSize[0x0400])
class UWolf_AnimBP_C : public UNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0400(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_EF1F80DB454E82FCD083EB979B5F281D;       // 0x0408(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93A533A74A021128DF286394ACBFC926; // 0x0448(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32EC030340D3CF09E18C5EAE5583ECD2; // 0x0490(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2FD9ADD14B8413D53BD2568149C06586; // 0x04D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB1FD90D4F7E0C7F8FFBE19EC379B69E; // 0x0520(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5352AF3A4B31A8657EA7AEA255F0F700; // 0x0568(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_634451884018388054765786D4D91451; // 0x05B0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B5BE77684A10951E67D9F6AEC476CFFA; // 0x0650(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2728FD2F402878631E1818A00D5AFB98; // 0x0690(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A3DBBC9A46304A4DF08386837CBA5952; // 0x0730(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AAA230494A0202D57763E78CB14D7A29; // 0x0770(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3A615F11487A4413DDFA6CB4873D1A4C; // 0x0810(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51C7D9824AD30BDF01EE2ABD3E1AB709; // 0x0850(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3EA05EC84D07E0202B8894912C2B6237; // 0x0898(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEA47FC2456EC25D4643708084EE6C42; // 0x08E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_531CF15043AC149B838B9788585467D0; // 0x0928(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_664C1F814EAF25D741EF91B705E63DFD; // 0x0970(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC13896B440C5715424C96B7DFB02904; // 0x09B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_918429D040EF4F2BE8589A9A60FDA14B; // 0x0A00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_237728BC41269F0949689BA6CF8E3016; // 0x0A48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_56C40F9E41FC22284EC551AAEFABA437; // 0x0A90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A22A2CD5400E8E25DD08999F52E6458F; // 0x0AD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E237860548E3C86782739C9BC1EA8613; // 0x0B20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6FA927C340E2D8556A9698B5845DC960; // 0x0B68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E1A747143DAF60CF8AC81ABD3235320; // 0x0BB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4856E1EB47B114747FE3DE92693B274E; // 0x0BF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F42EF814811D627294649A10FA532BF; // 0x0C40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_857391F34117E65199AAAE9FCDB15EAC; // 0x0C88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F3B3F094625A7C0CA0207A35D3B567B; // 0x0CD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0460DE484E8141D77EDCC883D51B2632; // 0x0D18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_369E5A38446CA1EB828AFD8A9E037981; // 0x0D60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_528E3CC442772FAC6083F7BCFB34F549; // 0x0DA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22CFD1FA4A3EDEEAC9DCDAB14300C9A8; // 0x0DF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_315ABC13466FB4988CFCC482810330F7; // 0x0E38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D15CC26B46AD268481CD22892315F256; // 0x0E80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F7FE95C422896D751D394B8878784B1; // 0x0EC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5692FE1A4411C7035831ECAA9EB5BC0A; // 0x0F10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4CE56D07480A474B8FD5879B09BA8C02; // 0x0F58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17D25E1F464B7427142956A75101652A; // 0x0FA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FDE25EC410037FC8F0BBF82C324B0AA; // 0x0FE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ABE21F634D5206AE67A9EEAF349C562B; // 0x1030(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C6DF95C46E2A15F6DA5319FDFDB3E78; // 0x1078(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_823832004983142C070A8DBBCA1AE7B4; // 0x10C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78DE19F54264B312F6D067A9667FC8B0; // 0x1108(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D2A53EEE4615DA3BF2B39EB39F8B4513; // 0x1150(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5AD8C79E4D34D27A7B56C98F70D92E07; // 0x1198(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_59368F98477E28BFD6B474AD0A65529E; // 0x11E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D536ABA04A955FDC1DA5F59FC016CB59; // 0x1228(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D6D052B14E7965C5408068ACC14BD0B2; // 0x1270(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_711AD6B04DCABD80BAA737884A59A8DF; // 0x12B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B6C4C04496C82127F75B498068E15A4; // 0x1300(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_021110CC4CFF34FF9F9395BC669549E9; // 0x1348(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1588867E4C60EF9F791730B91A253296; // 0x1390(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5D562AB04F938AA0203034A9AEFAC271; // 0x1430(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A1AA2AEB4B55938D003E438106CB4993; // 0x1470(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B0138A2745811BFD1282F9B710D65DB0; // 0x1510(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31281ACD4F9898EAEE77628830A2D396; // 0x1550(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F72C016241785E03EB740BB2F2CF8F35; // 0x15F0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A0C335924945D2845DFBFD839E10BF64; // 0x1630(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E34C37BC4E2C9ACFDB3954B27140A036; // 0x16D0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_316D44BC48784AB15F356FB53990BC7D; // 0x1710(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_07F8CB664B57C8B9127A1FA87104F00D; // 0x17B0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7144094246C671AAC631EEA8070D0606; // 0x17F0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6E7E92984ED2927F8C395199AC66E020; // 0x1890(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3275C4EB463DCB722A89F0B5945E4EF0; // 0x18D0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_27233AF84D89D1285B97C488F1C92D9A; // 0x1970(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8AD18E8042528FFD53658990EB757A6D; // 0x19B0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D31210C44362EE92BE901EB51BB672B4; // 0x1A50(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A0D112FD480DFF93EB67C4940D9F567A; // 0x1A90(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A0A05FC74DE0D65C552C7F9225CED252; // 0x1B70(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6015A924454C0E2EC1AD74872D4D13B7; // 0x1BB0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C475869C4F0A3D9BDE5069922566243B; // 0x1C50(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0C80F91F4D2409B5805448ACDEB239FF; // 0x1C90(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9C59FA0F4F324895FEE390B50A45CBEA; // 0x1D30(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_274A0F6F446DA3A338277CAA35515C68; // 0x1D70(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0CE2A5B047CEDAC031A36A952C853D27; // 0x1E10(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A51C8CB461FAC3900DF839B5B5319AA; // 0x1E50(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AA0DBE2E4DD4FF564FDF3385E02E1588; // 0x1EF0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84E1D561409DEA3BE8BEA2859F36DBE9; // 0x1F30(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_25BEC5944674024EA98663BD1F0F0086; // 0x1FD0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F00D448248CFE1ECB8B2FB8E90224827; // 0x2010(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_273058DC4FF548BA98C7D190C346EFDA; // 0x20B0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_99E68DC1459EBB75F8BAC9BABDBFF58D; // 0x20F0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0E919F8E43C1CAFAC32497AD9DBB681A; // 0x2190(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E232FBAD44B05305EBFEDFB9E46D98ED; // 0x21D0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_67D4824B443210E5F886C591C8CC185D; // 0x2270(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_862635BB42F0A096902A5EB20D5C92A1; // 0x22B0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_72BACF55416DDF533F1270999F89CFED; // 0x2350(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A6EEB00E4E24815809B71AA38E37AFE0; // 0x2390(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AA29274946839ECA272272BDD767AD3F; // 0x2430(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1D1C7F994B2EFC9C1C749484DD3C551C; // 0x2470(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AF1A923C436F6107BCE61C93FCFFF5E0; // 0x2510(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7B015D154142155FC6C40ABE24CF6E8E; // 0x2550(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6A5FDA1F4CBE4EA48EE77E8E580EFA7B; // 0x25F0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6E2ECFE14158CCFB925DC7AB0A08AEAE; // 0x2630(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3F76123F43ECF982FD437BB4EE655894; // 0x2710(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_114A0730464FD0241719889A58E4E1DE; // 0x2750(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A98A00D44CD31ACA50D46A8EDE5A8FE3; // 0x2830(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_482CDDBF4D5490306E6FD7A7548C988D; // 0x2870(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AB7BDFBE4C60E3C3BC4C0F93F46696AF; // 0x29A8(0x0138)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D78BFC4444C84003D56E56822DFC6D8B; // 0x2AE0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DB9E6D3C4F371B3B257ECB81AB1684D3; // 0x2B20(0x0138)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_43F884984821AD63388381B6CC933A9F; // 0x2C58(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D5164F214719DB48212C35828D2F8D79;       // 0x2D30(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_DB90E744417890B34BDF85A50CFFE547; // 0x2D98(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AFEF95904944597A40A26594FDAFB2A1; // 0x2E70(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D619F764423596C0BCF9A0A06C55C3F4; // 0x2EB8(0x0048)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Wolf_AnimBP.Wolf_AnimBP_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_E237860548E3C86782739C9BC1EA8613();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_6FA927C340E2D8556A9698B5845DC960();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_1E1A747143DAF60CF8AC81ABD3235320();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_4856E1EB47B114747FE3DE92693B274E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_DC13896B440C5715424C96B7DFB02904();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_2F42EF814811D627294649A10FA532BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_857391F34117E65199AAAE9FCDB15EAC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_3F3B3F094625A7C0CA0207A35D3B567B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_0460DE484E8141D77EDCC883D51B2632();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_664C1F814EAF25D741EF91B705E63DFD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_369E5A38446CA1EB828AFD8A9E037981();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_528E3CC442772FAC6083F7BCFB34F549();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_22CFD1FA4A3EDEEAC9DCDAB14300C9A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_315ABC13466FB4988CFCC482810330F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_531CF15043AC149B838B9788585467D0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_D15CC26B46AD268481CD22892315F256();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_0F7FE95C422896D751D394B8878784B1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_5692FE1A4411C7035831ECAA9EB5BC0A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_4CE56D07480A474B8FD5879B09BA8C02();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_AEA47FC2456EC25D4643708084EE6C42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_17D25E1F464B7427142956A75101652A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_4FDE25EC410037FC8F0BBF82C324B0AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_ABE21F634D5206AE67A9EEAF349C562B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_0C6DF95C46E2A15F6DA5319FDFDB3E78();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_3EA05EC84D07E0202B8894912C2B6237();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_823832004983142C070A8DBBCA1AE7B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_78DE19F54264B312F6D067A9667FC8B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_D2A53EEE4615DA3BF2B39EB39F8B4513();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_5AD8C79E4D34D27A7B56C98F70D92E07();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_51C7D9824AD30BDF01EE2ABD3E1AB709();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_59368F98477E28BFD6B474AD0A65529E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_D536ABA04A955FDC1DA5F59FC016CB59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_D6D052B14E7965C5408068ACC14BD0B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_711AD6B04DCABD80BAA737884A59A8DF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_8B6C4C04496C82127F75B498068E15A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_021110CC4CFF34FF9F9395BC669549E9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_5352AF3A4B31A8657EA7AEA255F0F700();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_BB1FD90D4F7E0C7F8FFBE19EC379B69E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_2FD9ADD14B8413D53BD2568149C06586();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_32EC030340D3CF09E18C5EAE5583ECD2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_93A533A74A021128DF286394ACBFC926();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_918429D040EF4F2BE8589A9A60FDA14B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_A22A2CD5400E8E25DD08999F52E6458F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_56C40F9E41FC22284EC551AAEFABA437();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Wolf_AnimBP_AnimGraphNode_TransitionResult_237728BC41269F0949689BA6CF8E3016();
	void ExecuteUbergraph_Wolf_AnimBP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
